{"pertanyaan": ["Apa yang akan dibahas dan dipelajari dalam mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Bagaimana Praktikum pada mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Matematika Teknik?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Pemrograman Dasar dan Praktikum (Progdas)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Organisasi dan Arsitektur Komputer (OAK)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Pemrograman Lanjut dan Praktikum (Proglan)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Perancangan Sistem Digital dan Praktikum (PSD)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Struktur Diskrit?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Jaringan Komputer dan Praktikum (Jarkom)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Pemrograman Berorientasi Objek dan Praktikum (PBO / OOP)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Dasar Rangkaian Elektronika (DRE)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Rangkaian Listrik (RL)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Statistika?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Aljabar Linier Lanjut (Alin Lanjut)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Sistem Siber Fisik dan Praktikum?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Analisis Algoritma?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Sistem Operasi?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Desain dan Manajemen Jaringan Komputer dan Praktikum (DMJ)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Sistem Basis Data dan Praktikum (SBD)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Praktikum Rangkaian Listrik dan Elektronik (Prak RL dan DRE)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Rekayasa Perangkat Lunak (RPL)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Sistem Waktu Nyata dan IoT dan Praktikum (IoT)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Keamanan Jaringan Komputer dan Praktikum (Kemjar)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Jaringan Telekomunikasi dan Praktikum (Jartel)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Arsitektur Komputer Modern?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Probabilitas dan Proses Stokastik (Probstok)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Teori Sinyal dan Analisis Sistem (Sinsis)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Desain Proyek Teknik Komputer 1 (Despro 1)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Pemrosesan Sinyal Multimedia (Mulmed)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Kecerdasan Buatan (AI)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Kewirausahaan dalam Teknologi Informasi (Kewirus)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Profesionalisme dan Etika dalam Teknologi Informasi (Profet)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah Desain Proyek Teknik Komputer 2 (Despro 2)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Big Data?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Komputasi Awan?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Interaksi Manusia dan Komputer (HCI)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Nirkabel?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Geospasial?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Kapita Selekta Teknik Komputer?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Dasar Regulasi dan Kebijakan Publik TIK (Dasreg)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Blockchain?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Blockchain?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Teknologi Blockchain?", "Apa saja buku ajar atau referensi untuk mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Apa saja buku ajar atau referensi untuk mata kuliah Matematika Teknik?", "Apa saja buku ajar atau referensi untuk mata kuliah Pemrograman Dasar dan Praktikum (Progdas)?", "Apa saja buku ajar atau referensi untuk mata kuliah Organisasi dan Arsitektur Komputer (OAK)?", "Apa saja buku ajar atau referensi untuk mata kuliah Pemrograman Lanjut dan Praktikum (Proglan)?", "Apa saja buku ajar atau referensi untuk mata kuliah Perancangan Sistem Digital dan Praktikum (PSD)?", "Apa saja buku ajar atau referensi untuk mata kuliah Struktur Diskrit?", "Apa saja buku ajar atau referensi untuk mata kuliah Jaringan Komputer dan Praktikum (Jarkom)?", "Apa saja buku ajar atau referensi untuk mata kuliah Pemrograman Berorientasi Objek dan Praktikum (PBO / OOP)?", "Apa saja buku ajar atau referensi untuk mata kuliah  Dasar Rangkaian Elektronika (DRE)?", "Apa saja buku ajar atau referensi untuk mata kuliah Rangkaian Listrik (RL)?", "Apa saja buku ajar atau referensi untuk mata kuliah Statistika?", "Apa saja buku ajar atau referensi untuk mata kuliah Aljabar Linier Lanjut (Alin Lanjut)?", "Apa saja buku ajar atau referensi untuk mata kuliah Sistem Siber Fisik dan Praktikum?", "Apa saja buku ajar atau referensi untuk mata kuliah Analisis Algoritma?", "Apa saja buku ajar atau referensi untuk mata kuliah Sistem Operasi?", "Apa saja buku ajar atau referensi untuk mata kuliah Desain dan Manajemen Jaringan Komputer dan Praktikum (DMJ)?", "Apa saja buku ajar atau referensi untuk mata kuliah Sistem Basis Data dan Praktikum (SBD)?", "Apa saja buku ajar atau referensi untuk mata kuliah Praktikum Rangkaian Listrik dan Elektronik (Prak RL dan DRE)?", "Apa saja buku ajar atau referensi untuk mata kuliah Rekayasa Perangkat Lunak (RPL)?", "Apa saja buku ajar atau referensi untuk mata kuliah Sistem Waktu Nyata dan IoT dan Praktikum (IoT)?", "Apa saja buku ajar atau referensi untuk mata kuliah Keamanan Jaringan Komputer dan Praktikum (Kemjar)?", "Apa saja buku ajar atau referensi untuk mata kuliah Jaringan Telekomunikasi dan Praktikum (Jartel)?", "Apa saja buku ajar atau referensi untuk mata kuliah Arsitektur Komputer Modern?", "Apa saja buku ajar atau referensi untuk mata kuliah Probabilitas dan Proses Stokastik (Probstok)?", "Apa saja buku ajar atau referensi untuk mata kuliah Teori Sinyal dan Analisis Sistem (Sinsis)?", "Apa saja buku ajar atau referensi untuk mata kuliah Desain Proyek Teknik Komputer 1 (Despro 1)?", "Apa saja buku ajar atau referensi untuk mata kuliah Pemrosesan Sinyal Multimedia (Mulmed)?", "Apa saja buku ajar atau referensi untuk mata kuliah Kecerdasan Buatan (AI)?", "Apa saja buku ajar atau referensi untuk mata kuliah Kewirausahaan dalam Teknologi Informasi (Kewirus)?", "Apa saja buku ajar atau referensi untuk mata kuliah Profesionalisme dan Etika dalam Teknologi Informasi (Profet)?", "Apa saja buku ajar atau referensi untuk mata kuliah Desain Proyek Teknik Komputer 2 (Despro 2)?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Teknologi Big Data?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Komputasi Awan?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Interaksi Manusia dan Komputer (HCI)?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Teknologi Nirkabel?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Teknologi Geospasial?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Kapita Selekta Teknik Komputer?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Dasar Regulasi dan Kebijakan Publik TIK (Dasreg)?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Teknologi Blockchain?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Kriptografi?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Perancangan VLSI?", "Apa yang harus dilakukan untuk mahasiswa tingkat akhir dinyatakan lulus?", "Apa saja predikat kelulusan program sarjana Universitas Indonesia?", "Apa saja syarat predikat kelulusan dengan pujian (cum laude) dan dengan pujian tertinggi (summa cum laude)?", "Apa kode mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Apa kode mata kuliah Matematika Teknik?", "Apa kode mata kuliah Pemrograman Dasar dan Praktikum (Progdas)?", "Apa kode mata kuliah Organisasi dan Arsitektur Komputer (OAK)?", "Apa kode mata kuliah Pemrograman Lanjut dan Praktikum (Proglan)?", "Apa kode mata kuliah Perancangan Sistem Digital dan Praktikum (PSD)?", "Apa kode mata kuliah Struktur Diskrit?", "Apa kode mata kuliah Jaringan Komputer dan Praktikum (Jarkom)?", "Apa kode mata kuliah Pemrograman Berorientasi Objek dan Praktikum (PBO / OOP)?", "Apa kode mata kuliah Dasar Rangkaian Elektronika (DRE)?", "Apa kode mata kuliah Rangkaian Listrik (RL)?", "Apa kode mata kuliah Statistika?", "Apa kode mata kuliah Aljabar Linier Lanjut (Alin Lanjut)?", "Apa kode mata kuliah Sistem Siber Fisik dan Praktikum?", "Apa kode mata kuliah Analisis Algoritma?", "Apa kode mata kuliah Sistem Operasi?", "Apa kode mata kuliah Desain dan Manajemen Jaringan Komputer dan Praktikum (DMJ)?", "Apa kode mata kuliah Sistem Basis Data dan Praktikum (SBD)?", "Apa kode mata kuliah Praktikum Rangkaian Listrik dan Elektronik (Prak RL dan DRE)?", "Apa kode mata kuliah Rekayasa Perangkat Lunak (RPL)?", "Apa kode mata kuliah Sistem Waktu Nyata dan IoT dan Praktikum (IoT)?", "Apa kode mata kuliah Keamanan Jaringan Komputer dan Praktikum (Kemjar)?", "Apa kode mata kuliah Jaringan Telekomunikasi dan Praktikum (Jartel)?", "Apa kode mata kuliah Arsitektur Komputer Modern?", "Apa kode mata kuliah Probabilitas dan Proses Stokastik (Probstok)?", "Apa kode mata kuliah Teori Sinyal dan Analisis Sistem (Sinsis)?", "Apa kode mata kuliah Desain Proyek Teknik Komputer 1 (Despro 1)?", "Apa kode mata kuliah Pemrosesan Sinyal Multimedia (Mulmed)?", "Apa kode mata kuliah Kecerdasan Buatan (AI)?", "Apa kode mata kuliah Kewirausahaan dalam Teknologi Informasi (Kewirus)?", "Apa kode mata kuliah Profesionalisme dan Etika dalam Teknologi Informasi (Profet)?", "Apa kode mata kuliah Desain Proyek Teknik Komputer 2 (Despro 2)?", "Apa kode mata kuliah pilihan Teknologi Big Data?", "Apa kode mata kuliah pilihan Komputasi Awan?", "Apa kode mata kuliah pilihan Interaksi Manusia dan Komputer (HCI)?", "Apa kode mata kuliah pilihan Teknologi Nirkabel?", "Apa kode mata kuliah pilihan Teknologi Geospasial?", "Apa kode mata kuliah pilihan Kapita Selekta Teknik Komputer?", "Apa kode mata kuliah pilihan Dasar Regulasi dan Kebijakan Publik TIK (Dasreg)?", "Apa kode mata kuliah pilihan Teknologi Blockchain?", "Apa kode mata kuliah pilihan Kriptografi?", "Apa kode mata kuliah pilihan Perancangan VLSI?", "Saya di semester depan terdapat 5 sks mata kuliah wajib, kalau misalnya ikut MBKM, apakah jadinya salah satu matkulnya gabisa diambil di semester depan karena seperti yg disebutkan max bobotnya 24 sks?", "Untuk surat rekomendasi MBKM yang perlu tanda tangan kaprodi DTE bagaimana ya?", "Saya telah mendapatkan Surat SPTJM dan Rekomendasi dari CIL namun terdapat kesalahan, apa yang harus saya lakukan?", "Saya sudah mengisi form dari CIL untuk SPTJM dan Rekomendasi MBKM tetapi belum mendapatkan balasan, apa yang harus saya lakukan?", "Untuk silabus program MBKM dapat dikirimkan ke mana ya?", "Untuk mata kuliah yang akan di drop karena mengikuti MBKM, apakah tetap harus mengikuti atau menghadiri perkuliahan di awal semester?", "Saya mengikuti MBKM dan tidak ada mata kuliah atau sks yang saya ikuti kemudian status akademis menjadi kosong, bagaimana ya?", "Untuk laporan MBKM dibutuhkan tanda tangan pembimbing MSIB pada lembar pengesahan, siapa pembimbing MSIB saya?", "Bagaimana sistem kualifikasi MBKM untuk konversi SKS terhadap mata kuliah yang ingin dikonversi?", "Untuk file persetujuan PA, terdapat jumlah konversi SKS, berapa yang harus diisikan?", "MBKM saya telah selesai, bagaimana cara mengajukan Transfer Kredit atau SKS?", "Saya diterima MBKM dan ingin mengajukan drop IRS apa yang harus saya lakukan?", "Bagaimana ketentuan MBKM yang ada pada DTE?", "Saya mahasiswa semester akhir rencananya mau lulus semester ini dan Mata Kuliah wajib tinggal Seminar Skripsi, apakah boleh ikut MBKM?", "Bolehkah saya ikut MBKM tapi tidak melakukan transfer kredit?", "Saya masih belum tahu apakah diterima MBKM atau tidak. Bagaimana mengisi IRS nya?", "Saya tidak diperkenankan mengambil 20 SKS karena IP semester sebelumnya kurang dari yang dibutuhkan, apakah saya dapat mengikuti MBKM?", "Berapa maksimum SKS yang diperbolehkan jika saya mengikuti MBKM pada semester selanjutnya?", "Saya mengikuti program di luar flagship Dikti dan kerjasama DTE (bukan MBKM, IISMA, Studi Independen), apakah dapat di Transfer Kredit?", "Saya mahasiswa Semester 5 atau belum mencapai 100 SKS, apakah boleh ikut MBKM flagship (Magang, Studi Independen, IISMA)?", "Di semester 7 saya masih harus mengambil Mata Kuliah wajib KP, Despro 2, dan Seminar/Pra-skripsi (lebih dari 4 sks) apakah boleh ikut MBKM?", "Apa saja jenis kegiatan MBKM yang dapat dilakukan?", "Apa saja cara dan syarat untuk mendaftarkan program MBKM?", "Bagaimana ketentuan MBKM untuk mahasiswa semester akhir?", "Apa saja tahapan pelaksanaan atau tata cara pelaksanaan MBKM?", "Apa saja yang harus dilakukan mahasiswa saat pelaksanaan MBKM?", "Bagaimana ketentuan transfer kredit dan pengakuan SKS untuk program MBKM?", "Berkas apa saja yang harus dikumpulkan untuk mengikuti program MBKM?", "Bagaiaman penilaian hasil belajar di Universitas Indonesia?", "Berapa nilai minimal untuk lulus dari suatu mata kuliah?", "Apa itu mata kuliah pilihan?", "Berapa SKS mata kuliah pilihan Pengembangan Profesional Terpadu 1 (PPT 1)?", "Apa kode mata kuliah pilihan Pengembangan Profesional Terpadu 1 (PPT 1)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Pengempangan Profesional Terpadu 1 (PPT 1)?", "Apa prasyarat untuk mata kuliah pilihan Pengembangan Profesional Terpadu 1 (PPT 1)?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Pengembangan Profesional Terpadu 1 (PPT 1)?", "Bagaimana prosedur atau tata cara pelaksanaan mata kuliah pilihan Pengembangan Profesional Terpadu 1 (PPT 1)?", "Berapa SKS mata kuliah pilihan Pengembangan Profesional Terpadu 2 (PPT 2)?", "Apa kode mata kuliah pilihan Pengembangan Profesional Terpadu 2 (PPT 2)?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah pilihan Pengempangan Profesional Terpadu 2 (PPT 2)?", "Apa prasyarat untuk mata kuliah pilihan Pengembangan Profesional Terpadu 2 (PPT 2)?", "Apa saja buku ajar atau referensi untuk mata kuliah pilihan Pengembangan Profesional Terpadu 2 (PPT 2)?", "Bagaimana prosedur atau tata cara pelaksanaan mata kuliah pilihan Pengembangan Profesional Terpadu 2 (PPT 2)?", "Apa saja mata kuliah pilihan yang dibuka pada semester ganjil (1, 3, 5, 7)?", "Apa saja mata kuliah pilihan yang dibuka pada semester genap (2, 4, 6, 8)?", "Apa prasyarat untuk mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Apa prasyarat untuk mata kuliah Matematika Teknik?", "Apa prasyarat untuk mata kuliah Pemrograman Dasar dan Praktikum (Progdas)?", "Apa prasyarat untuk mata kuliah Organisasi dan Arsitektur Komputer (OAK)?", "Apa prasyarat untuk mata kuliah Pemrograman Lanjut dan Praktikum (Proglan)?", "Apa prasyarat untuk mata kuliah Perancangan Sistem Digital dan Praktikum (PSD)?", "Apa prasyarat untuk mata kuliah Struktur Diskrit?", "Apa prasyarat untuk mata kuliah Jaringan Komputer dan Praktikum (Jarkom)?", "Apa prasyarat untuk mata kuliah Pemrograman Berorientasi Objek dan Praktikum (PBO / OOP)?", "Apa prasyarat untuk mata kuliah Dasar Rangkaian Elektronika (DRE)?", "Apa prasyarat untuk mata kuliah Rangkaian Listrik (RL)?", "Apa prasyarat untuk mata kuliah Statistika?", "Apa prasyarat untuk mata kuliah Aljabar Linier Lanjut (Alin Lanjut)?", "Apa prasyarat untuk mata kuliah Sistem Siber Fisik dan Praktikum?", "Apa prasyarat untuk mata kuliah Analisis Algoritma?", "Apa prasyarat untuk mata kuliah Sistem Operasi?", "Apa prasyarat untuk mata kuliah Desain dan Manajemen Jaringan Komputer dan Praktikum (DMJ)?", "Apa prasyarat untuk mata kuliah Sistem Basis Data dan Praktikum (SBD)?", "Apa prasyarat untuk mata kuliah Praktikum Rangkaian Listrik dan Elektronik (Prak RL dan DRE)?", "Apa prasyarat untuk mata kuliah Rekayasa Perangkat Lunak (RPL)?", "Apa prasyarat untuk mata kuliah Sistem Waktu Nyata dan IoT dan Praktikum (IoT)?", "Apa prasyarat untuk mata kuliah Keamanan Jaringan Komputer dan Praktikum (Kemjar)?", "Apa prasyarat untuk mata kuliah Jaringan Telekomunikasi dan Praktikum (Jartel)?", "Apa prasyarat untuk mata kuliah Arsitektur Komputer Modern?", "Apa prasyarat untuk mata kuliah Probabilitas dan Proses Stokastik (Probstok)?", "Apa prasyarat untuk mata kuliah Teori Sinyal dan Analisis Sistem (Sinsis)?", "Apa prasyarat untuk mata kuliah Desain Proyek Teknik Komputer 1 (Despro 1)?", "Apa prasyarat untuk mata kuliah Pemrosesan Sinyal Multimedia (Mulmed)?", "Apa prasyarat untuk mata kuliah Kecerdasan Buatan (AI)?", "Apa prasyarat untuk mata kuliah Kewirausahaan dalam Teknologi Informasi (Kewirus)?", "Apa prasyarat untuk mata kuliah Profesionalisme dan Etika dalam Teknologi Informasi (Profet)?", "Apa prasyarat untuk mata kuliah Desain Proyek Teknik Komputer 2 (Despro 2)?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Big Data?", "Apa prasyarat untuk mata kuliah pilihan Komputasi Awan?", "Apa prasyarat untuk mata kuliah pilihan Interaksi Manusia dan Komputer (HCI)?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Nirkabel?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Geospasial?", "Apa prasyarat untuk mata kuliah pilihan Kapita Selekta Teknik Komputer?", "Apa prasyarat untuk mata kuliah pilihan Dasar Regulasi dan Kebijakan Publik TIK (Dasreg)?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Blockchain?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Blockchain?", "Apa prasyarat untuk mata kuliah pilihan Teknologi Blockchain?", "Apa itu Registrasi Administrasi?", "Apa itu Registrasi Akademik?", "Bagaimana proses registrasi administrasi di Universitas Indonesia (UI) dilakukan?", "Bagaimana proses registrasi akademik di Universitas Indonesia (UI) dilakukan?", "Kapan proses registrasi administrasi dan registrasi akademik dilakukan?", "Kenapa IRS saya menjadi kosong dan status akademik saya juga menjadi kosong?", "Bagaimana cara mengajukan Cuti Akademik?", "Apa yang terjadi jika status akademik saya tidak aktif (kosong)?", "Apa yang harus saya lakukan jika status akademik saya tidak aktif (kosong) namun saya mengingikan status akademik aktif?", "Apa yang harus disiapkan untuk sidang KP (Kerja Praktik)?", "Apa saja yang harus dikumpulkan untuk sidang KP (Kerja Praktik)?", "Apa yang harus disiapkan untuk sidang Seminar (Sempro)?", "Apa saja yang harus dikumpulkan untuk sidang Seminar (Sempro)?", "Apa pakaian yang harus digunakan (Dresscode) untuk sidang KP / Seminar / Skripsi ?", "Apa saja yang harus dikumpulkan untuk sidang Skripsi atau Tugas Akhir?", "Apa yang harus disiapkan untuk sidang Skripsi atau Tugas akhir?", "Apa yang harus dilakukan setelah sidang Skripsi atau Tugas Akhir dilakukan?", "Bagaimana saya mendapatkan ide untuk judul tugas akhir / seminar / skripsi?", "Berapa SKS mata kuliah Dasar Sistem Digital dan Praktikum (DSD)?", "Berapa SKS mata kuliah Matematika Teknik?", "Berapa SKS mata kuliah Pemrograman Dasar dan Praktikum (Progdas)?", "Berapa SKS mata kuliah Organisasi dan Arsitektur Komputer (OAK)?", "Berapa SKS mata kuliah Pemrograman Lanjut dan Praktikum (Proglan)?", "Berapa SKS mata kuliah Perancangan Sistem Digital dan Praktikum (PSD)?", "Berapa SKS mata kuliah Struktur Diskrit?", "Berapa SKS mata kuliah Jaringan Komputer dan Praktikum (Jarkom)?", "Berapa SKS mata kuliah Pemrograman Berorientasi Objek dan Praktikum (PBO / OOP)?", "Berapa SKS mata kuliah Dasar Rangkaian Elektronika (DRE)?", "Berapa SKS mata kuliah Rangkaian Listrik (RL)?", "Berapa SKS mata kuliah Statistika?", "Berapa SKS mata kuliah Aljabar Linier Lanjut (Alin Lanjut)?", "Berapa SKS mata kuliah Sistem Siber Fisik dan Praktikum?", "Berapa SKS mata kuliah Analisis Algoritma?", "Berapa SKS mata kuliah Sistem Operasi?", "Berapa SKS mata kuliah Desain dan Manajemen Jaringan Komputer dan Praktikum (DMJ)?", "Berapa SKS mata kuliah Sistem Basis Data dan Praktikum (SBD)?", "Berapa SKS mata kuliah Praktikum Rangkaian Listrik dan Elektronik (Prak RL dan DRE)?", "Berapa SKS mata kuliah Rekayasa Perangkat Lunak (RPL)?", "Berapa SKS mata kuliah Sistem Waktu Nyata dan IoT dan Praktikum (IoT)?", "Berapa SKS mata kuliah Keamanan Jaringan Komputer dan Praktikum (Kemjar)?", "Berapa SKS mata kuliah Jaringan Telekomunikasi dan Praktikum (Jartel)?", "Berapa SKS mata kuliah Arsitektur Komputer Modern?", "Berapa SKS mata kuliah Probabilitas dan Proses Stokastik (Probstok)?", "Berapa SKS mata kuliah Teori Sinyal dan Analisis Sistem (Sinsis)?", "Berapa SKS mata kuliah Desain Proyek Teknik Komputer 1 (Despro 1)?", "Berapa SKS mata kuliah Pemrosesan Sinyal Multimedia (Mulmed)?", "Berapa SKS mata kuliah Kecerdasan Buatan (AI)?", "Berapa SKS mata kuliah Kewirausahaan dalam Teknologi Informasi (Kewirus)?", "Berapa SKS mata kuliah Profesionalisme dan Etika dalam Teknologi Informasi (Profet)?", "Berapa SKS mata kuliah Desain Proyek Teknik Komputer 2 (Despro 2)?", "Berapa SKS mata kuliah pilihan Teknologi Big Data?", "Berapa SKS mata kuliah pilihan Komputasi Awan?", "Berapa SKS mata kuliah pilihan Interaksi Manusia dan Komputer (HCI)?", "Berapa SKS mata kuliah pilihan Teknologi Nirkabel?", "Berapa SKS mata kuliah pilihan Teknologi Geospasial?", "Berapa SKS mata kuliah pilihan Kapita Selekta Teknik Komputer?", "Berapa SKS mata kuliah pilihan Dasar Regulasi dan Kebijakan Publik TIK (Dasreg)?", "Berapa SKS mata kuliah pilihan Teknologi Blockchain?", "Berapa SKS mata kuliah pilihan Kriptografi?", "Berapa SKS mata kuliah pilihan Perancangan VLSI?", "Berapa jumlah SKS yang dapat diambil pada setiap semester?", "Saya mendapatkan Indeks Prestasi Semester (IPS) atau IPK pada semester sebelumnya (contoh: 1,02; 2,45; 2,56; 3,56; 3,42; 3,98) berapa SKS yang dapat saya ambil untuk semester depan?", "Apakah ada keringangan untuk pengambilan SKS maksimum jika tidak memenuhi kriteria?", "Kenapa IRS saya tidak disetujui oleh Pembimbing Akademik atau Wakil Dekan?", "Saya sudah memenuhi 144 SKS tetapi masih ada mata kuliah wajib yang belum lulus, apakah saya dapat melaksanakan kelulusan?", "Apa itu mata kuliah spesial?", "Apa saja mata kuliah spesial yang ada di Teknik Komputer?", "Bagaimana cara atau prosedur mengambil mata kuliah spesial (kerja praktik, seminar, atau skripsi)?", "Berapa SKS mata kuliah spesial Kerja Praktik?", "Apa kode mata kuliah spesial Kerja Praktik?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah spesial Kerja Praktik?", "Apa prasyarat untuk mata kuliah spesial Kerja Praktik?", "Apa saja buku ajar atau referensi untuk mata kuliah spesial Kerja Praktik?", "Bagaimana tata cara pelaksanaan mata kuliah spesial Kerja Praktik?", "Apa yang harus dilakukan jika ingin melaksanakan sidang mata kuliah spesial Kerja Praktik?", "Berapa SKS mata kuliah spesial Seminar?", "Apa kode mata kuliah spesial Seminar?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah spesial Seminar?", "Apa prasyarat untuk mata kuliah spesial Seminar?", "Apa saja buku ajar atau referensi untuk mata kuliah spesial Seminar?", "Bagaimana tata cara pelaksanaan mata kuliah spesial Seminar?", "Apa yang harus dilakukan jika ingin melaksanakan sidang mata kuliah spesial Seminar?", "Berapa SKS mata kuliah spesial Skripsi?", "Apa kode mata kuliah spesial Skripsi?", "Apa yang akan dibahas dan dipelajari dalam mata kuliah spesial Skripsi?", "Apa prasyarat untuk mata kuliah spesial Skripsi?", "Apa saja buku ajar atau referensi untuk mata kuliah spesial Skripsi?", "Bagaimana tata cara pelaksanaan mata kuliah spesial Skripsi?", "Apa yang harus dilakukan jika ingin melaksanakan sidang mata kuliah spesial Skripsi?", "Kapan mata kuliah spesial (Kerja Praktik, Seminar, Skripsi) dapat diambil?", "Apabila mata kuliah spesial belum selesai pada semester diambil, apa yang terjadi dan apa yang harus dilakukan? ", "Apa saja mata kuliah wajib yang harus diambil pada semester ganjil (1, 3, 5, 7)?", "Apa saja mata kuliah wajib yang harus diambil pada semester genap (2, 4, 6, 8)?", "Apa tujuan Program Studi (Prodi) Teknik Komputer Fakultas Teknik Universitas Indoneisa (FTUI)?", "Bagaimana profil lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Bagaimana prospek lapangan kerja Program Studi (Prodi) Teknik Komputer FTUI?", "Apa Visi dan Misi Program Studi (Prodi) Teknik Komputer FTUI?", "Apa saja program yang disediakan pada Program Studi (Prodi) Teknik Komputer FTUI?", "Apa gelar yang diberikan untuk lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Bagaimana status akreditasi pada Program Studi (Prodi) Teknik Komputer FTUI?", "Berapa total SKS yang harus dipenuhi hingga kelulusan pada Teknik Komputer FTUI?", "Apa kompetensi lulusan / capaian pembelejaran (CP) atau ekspektasi lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Apa saja profil bidang pekerjaan lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Apa saja sikap yang harus dilakukan oleh mahasiswa dan lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Apa saja kompetensi penunjang yang dimiliki mahasiswa dan lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Apa saja kompetensi utama yang dimiliki mahasiswa dan lulusan Program Studi (Prodi) Teknik Komputer FTUI?", "Saya tidak dapat login ke dalam D'office apa yang harus saya lakukan?", "Untuk transfer sks dari MBKM nya tersebut apakah akan muncul di semester depan Bu?", "Jika KP, MK wajib & MK peminatan sudah diambil semua, maka kolom 'nama MK yang anda ajukan untuk konversi' dapat dikosongkan saja dan nanti transfernya akan dianggap sebagai MK pilihan semua?", "Saya saat ini menerima transfer MBKM sebesar 13 SKS, dan sesuai arahan Kaprodi alangkah baiknya untuk konversi ke Mata Kuliah Pilihan Bebas saja, apakah saya tetap harus menentukan mata kuliah pilihan yang mana untuk konversi SKS tanpa nilainya?", "Jika mau transfer nilai ke KP, laporan KP nya apakah menggunakan template di d'office (dari Dept), atau diperbolehkan menggunakan template laporan MBKM?", "Untuk pengajuan transfer kredit atau sks apakah ada deadline?", "Jika ingin mengajukan transfer kredit seluruh berkas yang diperlukan harus diapakan?", "Di form pengajuan TK ada bagian yang berjudul \"Notulensi Rapat Tim Transfer Kredit Departemen Teknik Elektro\", itu di kosongkan saja dan dikumpulkan / diisi saja yang dapat kita isi (nama,npm)?", "Semester untuk Transfer Kredit pada form yang Transfer kredit diisi semester berapa?", "Saya sudah mengajukan Transfer Kredit, di SIAK juga sudah ada pada tab Transfer Kredit, tetapi tidak terhitung SKS lulus, bagaimana ya?", "Saya sebelumnya ikut MBKM dan sudah transfer kredit, untuk jumlah SKS yang saya isi di form apakah dihitung dari SKS sekarang ditambah dengan SKS Konversi dari MBKM sebelumnya atau jumlah SKS yang ada di SIAK.NG nya?", "Bagaiman ketentuan transfer SKS pada kebijakan DTE?", "Apa itu Transfer Kredit atau SKS?", "Apakah benar jika kecerdasan buatan merupakan mata kuliah pilihan bagi angkatan 2019?", "Apa itu Aturan Kurikulum Transisi?", "Kapan Kurikulum 2020 mulai diberlakukan?", "Bagaimana jika mahasiswa belum lulus pada mata kuliah wajib pada kurikulum 2016 (lama) dan saat sudah menggunakan kurikulum baru?", "Apabila ada mata kuliah wajib pada kurikulum lama yang dijadikan mata kuliah pilihan di kurikulum 2020, apakah perlu diambil oleh angkatan yang mengalami transisi (2019, 2018, 2017, 2016)?", "Bagaimana perhitungan SKS apabila ada perubahan SKS pada mata kuliah yang sama di kurikulum baru?", "Bagaimana jika ada mata kuliah wajib baru di kurikulum 2020 yang belum diambil oleh mahasiswa kurikulum lama atau transisi?", "Bagaimana jika belum mengambil mata kuliah wajib yang dihapus pada kurikulum 2020 dan tidak ada kesetaraannya?", "Kurikulum apa yang digunakan pada Program Studi (Prodi) Teknik Komputer FTUI saat ini?", "Apa itu Dosen Pembimbing Akademik?", "Apa itu Kurikulum?", "Apa itu Mata Kuliah Wajib?", "Apa itu Mata Kuliah Wajib UI (Universitas Indonesia)?", "Apa itu Mata Kuliah Wajib Fakultas?", "Apa itu Mata Kuliah Wajib Program Studi (Prodi)?", "Apa itu Isian Rencana Studi (IRS)?", "Apa itu Satuan Kredit Semester (SKS)?", "Apa itu Masa Studi?", "Apa itu Semester dan Berapa lama satu semester berjalan?", "Apa itu Semester Antara atau Semester Pendek?", "Apa itu Cuti Akademik dan berapa lama dapat dilakukan?", "Apa tujuan dari program sarjana di Universitas Indonesia (UI)?", "Apa itu Yudisium?", "Apa yang harus disiapkan / dilakukan untuk mengikuti Yudisium?", "Berkas apa saja yang harus dilengkapi untuk diverifikasi untuk yudisium?"], "jawaban": ["Sistem digital dan informasi, Prinsip Aljabar Boolean dan aplikasinya; Interface Logic Families; Number System & Data Encoding; Basic Logic Circuits; Basic Modular Design of Combinational Circuits; Basic Modular Design of Sequential Circuits.\n\nDalam DSD juga terdapat Praktikum, Praktikum dilakukan pada Lab Digital dan terdapat 10 modul praktikum yang harus dikerjakan dalam 1 Semester", "Sistem digital dan informasi, Prinsip Aljabar Boolean dan aplikasinya; Interface Logic Families; Number System & Data Encoding; Basic Logic Circuits; Basic Modular Design of Combinational Circuits; Basic Modular Design of Sequential Circuits.\n\nDalam DSD juga terdapat Praktikum, Praktikum dilakukan pada Lab Digital dan terdapat 10 modul praktikum yang harus dikerjakan dalam 1 Semester", "Persamaan Diferential Biasa (Koefsien Konstan dan Tidak Konstan, linear, tak-linear), Persamaan Differential Partial, Persamaan Diferensial Diskrit, Transformasi Laplace, Transformasi Fourier, Transformasi z, unconstrained optimization, linear programming", "Pengenalan Komputer, Algoritma, Pseudocode, Pengenalan bahasa C, Pengendalian program dalam bahasa C, Program terstruktur dalam bahasa C, Fungsi, Array, Pointer, Struct,\nUnion, Enumeration", "Introduction, History of Microprocessor, Disigning for Performance, Top Level view of Computer System, Organisasi Prosesor; Memory; Peripheral subsystems; Fundamental of Assembly Programming; Addressing Modes; Data Transfer; Arithmetic and Logic Instruction, Program Control, Programming the Microprocessor", "Data structures: linked list, queue, stack, tree; Problem-solving strategies: searching, sorting; Recursion; Multi-threading, parallel programming", "Review of Sequential Circuit Design; VHDL; Control and datapath design; Design with programmable logic; System design constraints; Fault models, testing, and design for testability; Praktikum", "Boolean algebra principles; First-order logic; Proof techniques; Basics of counting; Graph and tree representations and properties; Iteration and recursion", "Arsitektur dan Topologi Jaringan, Protokol dan Komunikasi Jaringan; OSI dan TCP/IP Layer; Physical Layer, Data Link Layer, Ethernet Switching; Transport Layer, Application Layer; IPv4 Addressing; IPv6 Addressing; Subnetting; VLANs dan Inter-VLAN Routing; EtherChannel; FHRP; DHCPv4; DHCPv6; LAN Security; Wireless LAN; Routing Protokol Statik", "Java Language Elements; Java Language Operation; Defining and Using Class; System, Strings, StringBuffer, Math & Wrapper Classes; Array; Class & Inheritance; Design Graphical User Interface & Event Driven; Exceptions; Collections; Threads and Javadoc", "Pendahuluan, History and overview Electronic materials, diodes, and bipolar transistors, MOS transistor circuits, timing, and power Storage cell architecture Interfacing logic families.", "Pendahuluan, History and overview Relevant tools, standards, and/or engineering constraints Electrical quantities and basic elements Electrical circuits.", "Descriptive Statistics: Tables & Graph, Averages, Variability, Normal Distribution, Correlation, Regression, Inferential Statistics: Populations, Samples, and Probability, Sampling Distribution of the Mean, Z-test, Estimation, T-test", "discrete probability for high-dimensional vector spaces; matrices and graphs to model data; geometric approaches to eigen decompositions; least-squares; principal components analysis; data visualization", "Characteristics of embedded systems; Basic software techniques for embedded applications; Parallel input and output; Asynchronous and synchronous serial communication; Periodic interrupts, waveform generation, time measurement; Data acquisition, control, sensors, actuators; Praktikum", "Dasar analisis algoritma; Strategi algoritma; Algoritma klasik untuk tugas umum; Analisis dan desain algoritma untuk aplikasi khusus; Kompleksitas algoritma", "Operating Systems Stuctures; Process; Thread; CPU Scheduling; Concurency; Memorysystem management, storage management; distributed system architectures", "Skabalitas Jaringan; Routing Protokol Dinamis, Single Area dan Multiarea OSPF; EIGRP;Konsep Keamanan dalam jaringan; Akses Kontrol; Network Adress Translation (NAT); VPN dan IPSec;WAN technologies; Konsep QoS; Network Management; Network Design; Network Troubleshooting; Network Virtualization; Network Automation", "Database systems; Event-driven and concurrent programming; Using application programming interfaces", "Pendahuluan praktikum, Dioda, BJT, FET, Gerbang Logika; Dasar Kelistrikan dan analisis Mesh, Linearitas dan analisis simpul, Analisis superposisi dan Thevenin, Analisis Norton.", "Definisi, proses, dan masalah dalam rekayasa perangkat lunak; Artifacts dan Roles dalam Unified Software Development Process (USDP); Proses Tradisional: Waterfall Model, Spiral Model, Incremental Model; Proses Agile: XP, TDD, Scrum; Diagram UML; Dokumentasi Pengembangan Perangkat Lunak: Software Validation & Verification Plan (SVVP), Software Quality Assurance Plan (SQAP), Software Configuration Management Plan (SCMP), Software Project Management Plan (SPMP), Software Design Document (SDD), software test documention (STD); Berbagai prosedur implementasi dan kolaborasi dalam pembuatan perangkat lunak; Pengujian Sistem: Blackbox, Whitebox, Systematic Testing, dan resiko mengabaikan pengujian; Perawatan perangkat lunak: Jenis perawatan, Standar Prosedur Perawatan.", "Real-time operating system design; Operating systems for mobile devices; Support for concurrent processing; Implementation strategies for complex embedded systems; Techniques for low-power operation; Mobile and networked embedded systems; Advanced input/output issues; Computing platforms for embedded systems; Praktikum", "Keamanan dan Integritas Data; Vulnerabilities; Resource Protection; Private & Public Key Kriptografi; Autentikasi; Network and Web Security", "Pengantar Teknik Telekomunikasi, Teknik Modulasi (Amplitudo dan frekuensi); Modulasi Digital; Teknik Multiplexing; Coding; Sistem Teleponi; Teknologi perangkat telekomunikasi", "Pipelining, Input/Output interfacing and communication, Peripheral subsystems, Multi/Many-core architectures, Distributed system architectures.", "Introduction to probability, discrete random variables, continuous random variables, cumulatife distribution function, bivariate random variables, random vectors, Gaussian random vectors, random process, Markov Chains, Mean convergence.", "Analisa dasar sinyal dan sistem, berfokus pada representasi waktu-diskrit dan waktukontinu (fungsi singular, kompleks eksponensial dan geometrik, representasi Fourier, transformasi Laplace dan Z, pencuplikan/sampling) dan representasi sistem linear, time-invariant (persamaan selisih dan diferensial, blok diagram, fungsi sistem, pole dan zero, konvolusi, respon impuls dan step, respon frekuensi).", "Project management principles; Risk, dependability, safety and fault tolerance; IT Project Collaboration strategies; Relevant tools, standards and/or engineering constraints", "Pengantar Jaringan Multimedia, Pengkodean dan Kompresi Sinyal Multimedia, Analisis Sinyal Multimedia pada Jaringan IP, Restorasi citra, Pengolahan citra berwarna, Pengolahan citra morfologis, Segmentasi citra, Representasi dan deskripsi, Pengenalan obyek, Proyek: Kompresi file multimedia, pengolahan citra digital.", "Pengenalan machine learning dan artificial intelligence, regresi, clustering, classifier non ANN, classifier ANN, algoritma back-propagation, PCA untuk reduksi data, deep learning, perancangan sistem pengenalan berbasis ANN.", "Charging for Expertise, Think, Plan, Act Like Entrepreneur, Making a Business Successful, Taking the Initiative, Enabling an E-Business, Providing Outsource Services & Building a Contracting Business, kuliah tamu", "Etika; Job, Profesi dan Profesional; Profesi dalam teknologi informasi; organisasi dan kode etik ahli IT; etika cyber; hak cipta intelektual; kejahatan Internet", "Revisi rancangan, eksekusi rancangan, evaluasi", "Into to Data Engineering, Hadoop Architecture, The Hadoop Distributed Filesystem, Setting Up Hadoop Cluster, Administering Hadoop, MapReduce Framework, Developing a MapReduce Application, Hive Database, Spark Processing, Big Data Analytic Project", "Prinsip dasar arsitektur komputasi awan, dan landasan ekonomisnya temasuk SLA, skema biayanya dan mitigasi single-point-of-failures. Konsep-konsep yang mendasari seperti software defined architecture, virtualisasi dan cloud service. Layanan dasar komputasi awan berupa Infrastructure as a Service (Iaas). Containers, Virtual Machine, JVM, Docker, Kubernetes. Layanan Infrastruktur public cloud seperti AWS, Google Computer, Microsoft Azure dan sebagainya. Model layanan Metal as a Service (MaaS), Platform as a Service (PaaS) dan Web Service (Middleware) sebagai teknologi dalam komputasi awan. Jenis-jenis teknologi penyimpanan (storage) seperti Ceph, SWIFT, HDFS, NAS, SAN, Zookeeper.Termasuk juga teknologi object-storage seperti Amazon S3, virtualisasi block-storage dan juga layanan penyimpanan data dengan model cloud API serta cara mengintegrasikan teknologi penyimpanan cloud dalam aplikasi yang dikembangkan. Konsep keamanan pada komputasi awan yang meliputi kehandalan sistem, load balancing, keamanan data, dan keamanan jaringan. Konsep automasi cloud seperti praktek DevOps, continuous integration and deployment serta cara mengotomatisasikannya. Trend komputasi awan antara lain: Edge Computing. Fog Computing dan microservices.", "Faktor dalam HCI; alat input output; interaksi; rancangan interaksi; HCI dalam software process; design rules; implementation support; evaluation techniques; universal design", "Teknologi 802.11 (Wireless LAN); Teknologi 802.15 (Bluetooth, Zigbee, WPAN)", "History & Scope of Geospatial Technology, Source of Geospatial Data, Electromagnetic Radiation, Mapping Cameras, Digital Imagery, Image Interpretation, Geographic Information System (GIS), Geospatial Earth Observation Satellites, Active Microwave, Lidar, Thermal Imagery, Image Resolution, Hyperspectral data, Apps. in Geospatial Tech.: Change Detection, Plant Sciences, Land Use and Land Cover, City Planning, Disaster Assessment.", "Konsep teknologi komputer terbaru; Aplikasi teknologi komputer terbaru; Tradeoff pada teknologi baru bidang teknik komputer; Masalah terbaru dalam Teknik Komputer", "Administrasi Publik, Arti Penting Kebijakan Publik, Ragam Penelitian dan Metode Penelitian Kebijakan, Studi Perbandingan Kebijakan, Pengantar Hukum dan Regulasi Telekomunikasi, Tinjauan Ekonomi atas Regulasi Telekomunikasi, Isu-isu Kunci Regulasi Telekomounikasi, Memahami Tata Kelola Internet, Pemangku Kepentingan Tata Kelola Internet, Proses Tata Kelola Internet", "Sejarah blockchain, Trust model, Cryptography dan Hash function, Mekanisme consensus, Smart Contract, Aset, Regulasi blockchain", "Dasar-dasar matematika kriptografi, Algoritma Kriptografi klasik, Algoritma Kriptografi klasik Lanjutan, Dasar-dasar Kriptanalisis, Matematika Kriptografi Struktur Aljabar, Modern Block Chiper: Advanced Encryption Standard (AES), Aplikasi kriptografi symmetric, Algoritma asymetrik key modern RSA, Aplikasi kriptografi asymmetric, Certificate Authority/ Public Key Infrastructure", "Mixed-signal circuits; Design parameters issues; Circuit modelling & Simulation methods", "1. M. Morris R. Mano, Charles R. Kime, Tom Martin, Logic & Computer Design Fundamentals, 5th ed, Prentice Hall, 2015\n2. Ronald J. Tocci, Neal S. Widmer, and Gregory L. Moss, Digital Systems: Principles and Applications, 11th Ed., Prentice Hall, 2010\n3. Modul Praktikum Dasar Sistem Digital", "1. Erwin Kreyszig, “Advanced Engineering Mathematics”, 10th Edition, Wiley Publisher 2010.\n2. Glyn James, “Advanced Modern Engineering Mathematics”, 4th Edition, Pearson Education, 2011.", "1. Deitel & Deitel, “C How to Program,” 7 th Edition, Pearson Education, 2015", "1. W. Stallings, “Computer Organization and Architecture”, 10th Edition, Pearson International, 2015\n2. Brey, Barry B, The Intel Microprocessors: 8086/8088, 80186/80188, 80286, 80386, 80486, Pentium, Pentium Pro Processor, Pentium II, Pentium III, Pentium 4, and Core2 with 64-bit Extensions, 8th Ed., PHI Inc, USA, 2011", "1. Deitel & Deitel, “C How to Program”, 8th Edition, Pearson International Edition, 2015", "1. Charles H. Roth, Jr., Lizy K. John, Digital Systems Design Using VHDL, 2007 \n2. Bryan mealy, Fabrizio Tappero, Free Range VHDL, freerangefactory.org \n3. Modul Praktikum Perancangan Sistem Digital", "1. Kenneth H. Rosen, “Discrete Mathematics and Its Applications”, 7th Edition, McGraw- Hill Science/Engineering/Math; 2011\n2. Richard Johnsonbaugh, “Discrete Mathematics”, 7th Edition, Pearson Intl. Edition, PrenticeHall, NJ, 2009", "1. A. Tanenbaum, “Computer Networks”, Prentice Hall, 5th Eds, 2010\n2. CISCO, CCNA Networking Academy, https://www.netacad.com\n3. Huawei ICT Academy, HCIA Routing & Switching, https://e.huawei.com/en/talent/#/", "1. David J. Barnes, “Objects First with Java: A Practical Introduction Using BlueJ”, 5th Ed., Pearson, 2011\n2. Bart Baesens et.al., “Beginning Java Programming: The Object-Oriented Approach”, Wrox, 2015", "1. Robert Boylestad & Louis Nashelsky, \"Electronic Devices And Circuit Theory\", Ninth Edition, Prentice Hall, Upper Saddle River, New Jersey Columbus, Ohio, 2006.", "1. D.E. Johnson, J.R. Johnson, et.all., “Electric Circuit Analysis”, 3rd Edition, Prentice Hall International, Inc., 1997, (Chapter 1-9).\n2. J. W. Nilsson, S.A. Riedel, “Electric Circuits”, 10th Edition, Prentice Hall International Inc., 2014.", "1. Robert S. Witte and John S. Witte, “Statistics”, 11th ed., Wiley, 2017\n2. Ronald E. Walpole, et.al, “Probability & Statistics for Engineers & Scientists”, 9th ed., Prentice Hall, 2012", "1. Howard Anton, Chris Rorres, Anton Kaul, Elementary Linear Algebra, Applications Version, 12th Edition, Wiley, 2019 \n2. Marc Peter Deisenroth, A. Aldo Faisal, Cheng Soon Ong, Mathematics for Machine Learning, Cambridge University Press, 2020 \n3. Joel Grus, Data Science from Scratch, 2nd ed., Oreilly, 2019", "1. The 8051 Microcontroller and Embedded Systems, Second Edition, Muhammad Ali Mazidi, Prentice Hall, 2006\n2. Lee & Seshia, “Introduction to Embedded Systems - A Cyber-Physical Systems Approach”, 2 nd edition, UC-Berkeley, 2015", "1. Thomas H. Cormen, “Introduction to Algorithms”, 3rd Edition, MIT Press, 2009\n2. Robert Sedgewick dan Kevin Wayne, “Algorithms”, 4th Edition, Addison-Wesley Professional, 2011", "1. Abraham Silberschatz, \"Operating System Concepts\", 9th Ed., Dec. 17, 2012\n2. Andrew S. Tanenbaum, \"Modern Operating Systems\", Pearson, Mar. 20, 2014", "1. James D. McCabe, \"Network Analysis, Architecture, and Design\", 3nd Edition, Morgan Kaufmann, 2007\n2. CISCO, CCNA Networking Academy, https://www.netacad.com\n3. Huawei ICT Academy, HCIA Routing & Switching, https://e.huawei.com/en/talent/#/", "1. Ramez Elmasri, Shamkant B. Navathe, Fundamentals of Database Systems, 7th ed., Pearson, June 18, 2015\n2. Avi Silberschatz et al., “Database System Concepts”, 6th Edition, McGraw-Hill, 2011", "1. Robert Boylestad & Louis Nashelsky, \"Electronic Devices And Circuit Theory\", Ninth Edition, Prentice Hall, Upper Saddle River, New Jersey Columbus, Ohio, 2006.\n2. D.E. Johnson, J.R. Johnson, et.all., “Electric Circuit Analysis”, 3rd Edition, Prentice Hall International, Inc., 1997, (Chapter 1-9).\n3. J. W. Nilsson, S.A. Riedel, “Electric Circuits”, 10th Edition, Prentice Hall International Inc., 2014.\n4. Modul Praktikum Rangkaian Listrik dan Elektronik", "1. Ian Sommerville, Software Engineering, 10th Ed., Pearson, April 3, 2015\n2. Robert C. Martin, Agile Software Development, Principles, Patterns, and Practices, Pearson 2002", "1. Peter Marwedel, Embedded System Design : Embedded Systems, Foundations of CyberPhysical Systems, and the Internet of Things, 3rd ed, Springer International Publishing, 2018 \n2. Xiaocong Fan, Real-Time Embedded Systems: Design Principles and Engineering Practices, Elsevier, 2015 \n3. Sam Siewert & John Pratt, Real-time embedded components and systems with linux and RTOS, Mercury Learning and Information, 2016", "1. W. Stallings, “Network Security Essentials: Application and Standards, 5/E, Prentice Hall, 2013.\n2. R.R.Panko, Corporate Computer and Network Security, Prentice-Hall, 2004\n3. M.E.Whitman and H.J.Mattord, Principles of Information Security, Thomson Course, 2003", "1. S. Haykin, “Communication Systems”, 5th Edition, John Wiley & Sons Inc., 2008.\n2. R.L. Freeman, “Telecommunication Systems Engineering”, 4th Edition, John Wiley & Sons Inc., 2004", "1. John L. Hennessy, David A. Patterson, Computer Architecture: A Quantitative Approach, 6th ed., Morgan Kaufmann, 2017.", "1. John A. Gubner, “Probability and Random Processes for Electrical and Computer Engineers”, Cambridge University Press, 2006\n2. Steven Kay, “Intuitive Probability and Random Processes Using Matlab”, Springer, 2006\n3. Saeed Ghahramani, “Fundamentals of Probability with Stochastic Process”, 4th ed., CRC Press, 2019", "1. Simon Haykin and Barry Van Veen. 2002. Signals and Systems (2nd. ed.). John Wiley & Sons, Inc., USA.", "1. K. Schwalbe, “Information Technology Project Management”, 7th Edition, Course Technology, 2013.\n2. W.S. Humphrey, “Introduction to the Team Software Process”, Addison Wesley 2000.\n3. Modul Desain Proyek Teknik Komputer", "1. J.N. Hwang, “Multimedia Networking: From Theory to Practice,” Cambridge University Press, 2009.\n2. R.C. Gonzalez and R.E. Woods, Digital Image Processing, 3rd Edition, Prentice-Hall, 2007.", "1. Christopher M. Bishop, Pattern Recognition and Machine Learning, Springer, 2011 2. John D. Kelleher, Brian Mac Namee, and Aoife D’Arcy, Fundamentals of Machine Learning for Predictive Data Analytics: Algorithms, Worked Examples, and Case Studies, The MIT Press, 2015.", "1. Bill Aulet, Disciplined Entrepreneurship: 24 Steps to a Successful Startup, Wiley, 2013", "1. ACM Code of Ethics and Porfessional Conduct, https://www.acm.org/about-acm/acm-code-of-ethics-and-professional-conduct;\n2. IEEE Code of Ethics, https://www.ieee.org/about/corporate/governance/p7-8.html\n3. British Computer Society Code of Conduct, https://www.bcs.org/media/2211/bcs-code-of-conduct.pdf.\n4. George W. Reynolds, “Ethics in Information Technology” 5th Edition, Cengage Learning, 2015.\n5. Frank Bott, “Professional Issues in Information Technology”, British Computer Society, 2005.\n6. Undang Undang Informasi dan Transaksi Elektronik (UU ITE) – diunduh di EMAS UI", "Tidak ada", "1. Jure Leskovec, Anand Rajaraman, Jeff Ullman, Mining of Massive Datasets, Cambridge University Press, 2014\n2. Tom White,”Hadoop: The Definition Guide”, Third Edition, O’Relly, 2012", "Buku Teks:\n1. Cloud Computing Design Patterns, Thomas Erl, Robert Cope, Amin Naserpour, Prentice Hall, 2015, ISBN:978-0-13-385856-3\nReferensi:\n1. Dokumentasi cloud service AWS, Google, Microsoft Azure\n2. www.openstack.org , www.cncf.io", "1. A.J. Dix, J.E. Finlay, G.D. Abowd and R. Beale, “Human-Computer Interaction”, Third Edition, Prentice Hall, USA, 2003.\n2. B. Shneiderman and C. Plaisant, “Designing The User Interface: Strategies for Effective Human Interaction”, Fifth Edition, Pearson-Addison Weasley, 2010.", "1. Eldad Perahia, \"Next Generation Wireless LANs: 802.11n and 802.11ac,\" 2nd Edition, Cambridge University Press;\n2 edition, June 24, 2013 2. Al Petrick, \"IEEE 802.11 Handbook: A Designer's Companion,\" 2nd Edition, IEEE Standards Information Network, 2005", "1. J.D. Bossler, J.R. Jensen, R.B. McMaster, C. Rizos,\"Manual of Geospatial Science and Technology,\" CRC Press, 2001.\n2. J.B. Campbell and R.H. Wynne, “Introduction to Remote Sensing”, 5th Edition, The Guildford Press, NY, 2011.\n3. Canadian Centre for Remote Sensing, “Fundamental of Remote Sensing”", "Tidak ada. (Akan ditentukan kemudian seiring berjalannya perkuliahan)", "1. Ian Walden,“Telecommunications Law and Regulation”, Oxford University Press, 2012\n2. Jovan Kurbalija, “Tentang Tata Kelola Internet: Sebuah Pengantar”, APJII, 2011\n3. Riant Nugroho, “Public Policy: Dinamika Kebijakan, Analisis Kebijakan, Manajemen Kebijakan”, Elex Media Komputindo, 2012", "1. \"Architecture for Blockchain Applications\", Ingo Weber, Mark Staples, and Xiwei Xu, Springer, 2019\n2. \"Programming Bitcoin: Learn How to Program Bitcoin from Scratch\", Jimmy Song, Oreilly, 2019\n3. \"Blockchain: Blueprint for a New Economy\", 1st Edition, Melanie Swan, Oreilly, 2015", "1. Forouzan, Behrouz A., and Debdeep Mukhopadhyay. Cryptography and Network Security (Sie). McGraw-Hill Education, 2011.\n2. Stallings, William. \"Cryptography and Network Security. 2005.\" ISBN: 0-13-187316-4.\n3. Attaway, Stormy. Matlab: a practical introduction to programming and problem solving. Butterworth-Heinemann, 2013.\n4. Hoffstein, Jeffrey, et al. An introduction to mathematical cryptography. Vol. 1. New York: springer, 2008.\n5. Menezes, Alfred J., Paul C. Van Oorschot, and Scott A. Vanstone. Handbook of applied cryptography. CRC press, 1996.\n6. Stinson, Douglas R. Cryptography: theory and practice. CRC press, 2005", "1. N.E. Weste and K. Eslughian, “Principle of CMOS VLSI Design”, Addison-Wesley, 1985.\n2. F.M. Berti, “Analog Design For CMOS VLSI System”, Kluwer Academic Publisher, 2006.", "Mahasiswa Program Sarjana dinyatakan lulus dalam hal memenuhi persyaratan berikut:\na. terdaftar sebagai Mahasiswa aktif baik secara administratif maupun secara akademik pada Semester tersebut;\nb. tidak melampaui Masa Studi maksimum yang ditetapkan UI;\nc. menyelesaikan semua kewajiban administratif termasuk mengembalikan semua koleksi\nperpustakaan/ laboratorium yang dipinjam; dan\nd. telah menyelesaikan semua kewajiban dalam Masa Studi dan/atau tugas yang dibebankan sesuai dengan Kurikulum yang ditetapkan untuk Program Studi dengan Indeks Prestasi Kumulatif (IPK) lebih besar atau sama dengan 2,OO (dua koma nol nol).", "Predikat kelulusan setelah menyelesaikan Program Sarjana terdiri atas tingkatan berdasarkan Indeks Prestasi Kumulatif (IPK):\na. 2,76-3,24 = memuaskan;\nb. 3,25 - 3,60 : sangat memuaskan;\nc. 3,61 - 3,89 = dengan pujian (cum laude);\nd. 3,90 - 4,00 = dengan pujian tertinggi", "Predikat kelulusan dengan pujian (cum laude) dan dengan pujian tertinggi ls-umma a.tm laudel diberikan kepada lulusan Program Sarjana yang menyelesaikan studi selambat-lambatnya dalam 8 (delapan) Semester, tanpa cuti, tanpa mengulang mata kuliah, serta memiliki Indeks Prestasi Kumulatif (IPK) minimal 3,61 untuk anm laude dan minimal 3,90 untuk summa cum laude", "ENEE602005", "ENEE603008", "ENCE601001", "ENCE602002", "ENCE602003", "ENCE603004", "ENCE603005", "ENCE603006", "ENCE603007", "ENCE603008", "ENCE603009", "ENCE603010", "ENCE604011", "ENCE604012", "ENCE604013", "ENCE604014", "ENCE604015", "ENCE604016", "ENCE604017", "ENCE605018", "ENCE605019", "ENCE605020", "ENCE605021", "ENCE605022", "ENCE605023", "ENCE605024", "ENCE606025", "ENCE606026", "ENCE606027", "ENCE606029", "ENCE606030", "ENCE607031", "ENCE605034", "ENCE606035", "ENCE606036", "ENCE606037", "ENCE607038", "ENCE607039", "ENCE607041", "ENCE608042", "ENCE608044", "ENCE608045", "Maksimal SKS 1 Semester tetap 24 SKS, jika ditambah MBKM lebih dari 24 SKS, maka lebihnya akan di drop salah satu mata kuliah, mata kuliah lainnya dapat diambil di semester lainnya", "Permintaan surat rekomendasi hanya dari CIL dan dapat diakses dari website CIL UI https://cil.ui.ac.id/", "Hubungi pihak CIL UI melalui whatsapp yang tertera dari website CIL UI https://cil.ui.ac.id/", "Hubungi pihak CIL UI melalui whatsapp yang tertera dari website CIL UI https://cil.ui.ac.id/", "Silabus program MBKM dapat dikirimkan melalui form yang tertera di dalam deskripsi grup MBKM", "Untuk sementara hingga diproses drop mata kulihanya, maka silahkan menghadiri kelas seperti biasa", "Status akademis akan berubah menjadi Merdeka Belajar", "Pembimbing MBKM anda dapat dilihat pada link yang terdapat pada deskripsi grup MBKM", "Sistem kualifikasi MBKM terhadap mata kuliah tertentu dilihat dari silabus yang harus dikumpulkan ke departemen sebelum MBKM berlangsung", "20 SKS", "Ajukan melalui form berikut Pengajuan Transfer Kredit\nhttps://bit.ly/TK_MBKM_DTE", "Isi form pada link berikut untuk Drop IRS: \nhttps://forms.gle/4CLzpt4oELhXqjP68", "Silahkan buka panduan DTE & FT pada link berikut Panduan DTE & FT: https://bit.ly/3zSBngX", "Tidak boleh mengikuti MBKM", "Jika mengikuti MBKM flagship DIKTI (dari web Kampus Merdeka, Magang & Studi Indendent, IISMA, dan semacamnya) maka harus dilakukan transfer kredit (aturan Dikti). Jika anda ingin ikut Magang/kegiatan lain di luar kerangka Kampus Merdeka, silahkan.", "Isi IRS seperti biasa. Jika keluar pengumuman MBKM dan anda diterima setelah masa pengisian IRS berakhir, silahkan mengajukan DROP IRS segera setelah pengumuman keluar (kira-kira maks 1 bulan setelah kuliah berjalan)", "Peserta MBKM mendapatkan privilege jumlah SKS maksimum sebesar 24 SKS, tanpa melihat IP Semester yang didapatkan pada semester sebelumnya.\n\nMaksimum SKS di SIAK yang boleh diambil di semester tersebut adalah 4 SKS, kecuali untuk mahasiswa yang sedang menyelesaikan tugas akhir, maka dapat mengambil Seminar + Skripsi (6 SKS)", "Peserta MBKM mendapatkan privilege jumlah SKS maksimum sebesar 24 SKS, tanpa melihat IP Semester yang didapatkan pada semester sebelumnya.\n\nMaksimum SKS di SIAK yang boleh diambil di semester tersebut adalah 4 SKS, kecuali untuk mahasiswa yang sedang menyelesaikan tugas akhir, maka dapat mengambil Seminar + Skripsi (6 SKS)", "Program MBKM di luar flagship Dikti dan kerjasama DTE, pada dasarnya dapat ditransfer-kreditkan sesuai kebijakan Program Studi (Prodi) (akan ditentukan kemudian).", "Minimal sudah lulus semester 5. Perhatikan bahwa banyak mata kuliah wajib di semester 5 yang masih harus diambil, yang mana MK tersebut akan menjadi prasyarat untuk semester 6", "KP bisa ditransfer kredit dari MBKM (tidak perlu dimasukan ke IRS). Seminar diisikan di D'Office dan mulai bimbingan pada semester 7 tetapi diisikan ke IRS di semester 8 (Sidang di awal semester 8). Despro 2 diampil di semester 7 sehingga total SKS di IRS hanya 3 SKS", "Pertukaran mahasiswa dalam dan luar negeri (IISMA, dsb), Magang/Praktik Kerja, Asisten Mengajar di satuan pendidikan, Penelitian/Riset, Proyek Kemanusiaan, Kegiatan Wirausaha, Studi/Proyek Independen, KKN, Bela Negara, dan program lain yang diakui sebagai program MBKM (dapat dibaca lebih lengkap pada: https://bit.ly/3zSBngX", "Persyaratan mahasiswa FTUI sebagai peserta program MBKM sebagai berikut:\na. Terdaftar sebagai mahasiswa aktif yang tertera di SIAK NG dan PD DIKTI pada Tahun Akademik Berjalan;\nb. Memenuhi persyaratan telah menyelesaikan mata kuliah paling sedikit 100 SKS atau sudah menyelesaikan lima (5) semester dan / atau persyaratan lain sesuai dengan program MBKM yang akan diikuti. (Catatan: Bagi mahasiswa yang mengikuti program MBKM pada semester terakhir yang direncanakan untuk menyelesaikan studi, maka batas akhir periode pelaksanaan program MBKM wajib selambat-lambatnya dua minggu sebelum jadual yudisium departemen untuk dapat diproses pengakuan SKS/transfer kredit);\nc. Lolos seleksi sesuai dengan yang disyaratkan oleh Program Studi (Prodi)/departemen atau program MBKM yang didaftar;\nd. Membuat surat pernyataan mengikuti program MBKM dengan diketahui oleh Dosen Pembimbing Akademik dan Ketua Program Studi (Prodi)/Departemen;\ne. Mendapatkan surat rekomendasi dari CIL untuk mengikuti program MBKM", "Apabila merencanakan lulus pada semester saat mengikuti MBKM, maka batas akhir pelaksanaan program MBKM wajib selambat-lambatnya dua minggu sebelum yudisium departemen untuk pengakuan SKS atau transfer kredit", "Pelaksaan atau prosedur MBKM dapat dilihat pada link berikut https://bit.ly/3zSBngX di bagian Bab 4 Prosedur Pelaksanaan MBKM", "Persyaratan mahasiswa FTUI sebagai peserta program MBKM sebagai berikut:\na. Terdaftar sebagai mahasiswa aktif yang tertera di SIAK NG dan PD DIKTI pada Tahun Akademik Berjalan;\nb. Memenuhi persyaratan telah menyelesaikan mata kuliah paling sedikit 100 SKS atau sudah menyelesaikan lima (5) semester dan / atau persyaratan lain sesuai dengan program MBKM yang akan diikuti. (Catatan: Bagi mahasiswa yang mengikuti program MBKM pada semester terakhir yang direncanakan untuk menyelesaikan studi, maka batas akhir periode pelaksanaan program MBKM wajib selambat-lambatnya dua minggu sebelum jadual yudisium departemen untuk dapat diproses pengakuan SKS/transfer kredit);\nc. Lolos seleksi sesuai dengan yang disyaratkan oleh Program Studi (Prodi)/departemen atau program MBKM yang didaftar;\nd. Membuat surat pernyataan mengikuti program MBKM dengan diketahui oleh Dosen Pembimbing Akademik dan Ketua Program Studi (Prodi)/Departemen;\ne. Mendapatkan surat rekomendasi dari CIL untuk mengikuti program MBKM", "Terdapat 3 bentuk yaiut Bentuk Terstruktur, Bentuk Bebas, dan Bentuk Bauran. Untuk lebih lengkapnya dapat dilihat pada link berikut https://bit.ly/3zSBngX di bagian Bab 5 Mekanisme Pengakuakn Satuan Kredit Semester dan Transfer Kredit", "Persyaratan mahasiswa FTUI sebagai peserta program MBKM sebagai berikut:\na. Terdaftar sebagai mahasiswa aktif yang tertera di SIAK NG dan PD DIKTI pada Tahun Akademik Berjalan;\nb. Memenuhi persyaratan telah menyelesaikan mata kuliah paling sedikit 100 SKS atau sudah menyelesaikan lima (5) semester dan / atau persyaratan lain sesuai dengan program MBKM yang akan diikuti. (Catatan: Bagi mahasiswa yang mengikuti program MBKM pada semester terakhir yang direncanakan untuk menyelesaikan studi, maka batas akhir periode pelaksanaan program MBKM wajib selambat-lambatnya dua minggu sebelum jadual yudisium departemen untuk dapat diproses pengakuan SKS/transfer kredit);\nc. Lolos seleksi sesuai dengan yang disyaratkan oleh Program Studi (Prodi)/departemen atau program MBKM yang didaftar;\nd. Membuat surat pernyataan mengikuti program MBKM dengan diketahui oleh Dosen Pembimbing Akademik dan Ketua Program Studi (Prodi)/Departemen;\ne. Mendapatkan surat rekomendasi dari CIL untuk mengikuti program MBKM", "Penilaian hasil belajar dinyatakan dengan huruf A, A-, B+, B, B-, C+, C, D, dan E", "Nilai lulus minimal setiap mata kuliah dan Tugas Akhir adalah C", "Mata Kuliah Pilihan merupakan mata kuliah yang dirancang sebagai mata kuliah yang memberikan pendalaman lebih lanjut dari keilmuan Teknik Komputer. Mata kuliah ini tidak wajib diambil namun tetap diperlukan untuk pemenuhan SKS.", "2 SKS", "ENCE607040", "1. Kegiatan professional terpadu dilaksanakan secara mandiri di dalam suatu organisasi/industri (magang) yang berorientasi pada proyek keteknikan yang menerapkan keahlian yang diakumulasikan selama mengikuti proses pembelajaran di Program Studi (Prodi).\n2. Kegiatan ini merupakan kelanjutan dari Mata Kuliah Kerja Praktek dan dilaksanakan secara paruh waktu antara 10 -16 jam per minggu dengan lama kegiatan antara 10 - 14 minggu (1 semester perkuliahan). Karena sifat kegiatan yang paruh waktu, mahasiswa dapat mengelola jadwalnya secara fleksibel bersama dengan kegiatan perkuliahan berjalan.\n3. Sebelum melakukan magang mahasiswa harus membuat Surat Kesepakatan antara ketiga belah pihak (organisasi/industri, universitas dan mahasiswa) yang memuat rencana kerja serta hak dan kewajiban mahasiswa selama magang di organisasi/industri.\n4. Mahasiswa wajib menyerahkan portofolio kegiatan Pengembangan Professional Terpadu dalam bentuk: a) Log komprehensif kegiatan mingguan yang diparaf oleh supervisor/team leader di organisasi/industri (format Log-book sesuai yang ditentukan oleh Departemen) - log ini harus dilaporkan per minggu ke dosen yang ditunjuk sebagai pembimbing sebagai bagian dari proses monitoring. b) Laporan akhir hasil kegiatan dan capaian lainnya (sertifikat/draft paten/dokumen disain/engineering) c) Evaluasi diri dan evaluasi dari supervisor/team leader di organisasi/industri (format ditentukan Departemen) di akhir kegiatan.\n5. Portofolio pada point 3 di atas digunakan dalam rubrik penilaian capaian pelaksanaan mata kuliah khusus ini", "Telah lulus 85 SKS", "Tidak ada", "Untuk prosedur pelaksanaan dan timeline mata kuliah khusus PPT-1 tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "2 SKS", "ENCE608043", "Pengakuan Sertifikasi dan Pengakuan Kompetisi", "Tidak ada", "Tidak ada", "Untuk prosedur pelaksanaan dan timeline mata kuliah khusus PPT-2 tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "Teknologi Big Data, Teknologi Geospasial, Kapita Selekta Teknik Komputer, Pengembangan Profesional Terpadu - 1, Dasar Regulasi dan Kebijakan Publik TIK", "Komputasi Awan, Interaksi Manusia dan Komputer, Teknologi Nirkabel, Teknologi Blockchain, Pengembangan Progesional Terpadu - 2, Kriptografi, Perancangan VLSI", "Tidak ada", "Kalkulus", "Tidak ada", "Pemrograman Dasar dan Praktikum", "Pemrograman Dasar dan Praktikum", "Dasar Sistem Digital dan Praktikum", "Pemrograman Dasar dan Praktikum, Dasar Sistem Digital dan Praktikum", "Dasar Sistem Digital dan Praktikum", "Pemrograman Lanjut", "Fisika Listrik, Magnet, Gelombang dan Optik", "Fisika Listrik, Magnet, Gelombang dan Optik", "Tidak ada", "Aljabar Linier", "Organisasi Arsitektur Komputer, Perancangan Sistem Digital", "Pemrograman Lanjut dan Praktikum, Struktur Diskrit", "Organisasi Arsitektur Komputer", "Jaringan Komputer dan Praktikum", "Struktur Diskrit", "Rangkaian Listrik, Dasar Rangkaian Elektronika", "Pemrograman Berorientasi Objek dan Praktikum", "Sistem Operasi, Sistem Siber-Fisik dan Praktikum", "Desain dan Manajemen Jaringan Komputer dan Praktikum", "Jaringan Komputer dan Praktikum, Teori Sinyal dan Analisis Sistem", "Organisasi dan Arsitektur Komputer", "Kalkulus, Aljabar Linier, Statistika", "Matematika Teknik", "Sistem Siber Fisik dan IoT dan Praktikum, Jaringan Komputer dan Praktikum, Pemrograman Lanjut dan Praktikum", "Pemrograman Lanjut, Teori Sinyal dan Analisis Sistem", "Aljabar Linier, Pemrograman Lanjut dan Praktikum", "Tidak ada", "Tidak ada", "Desain Proyek Teknik Komputer 1", "Sistem Basis Data, Pemrograman Berorientasi Objek dan Praktikum", "Sistem Basis Data dan Praktikum", "Rekayasa Perangkat Lunak", "Jaringan Telekomunikasi dan Praktikum", "Pemrograman Dasar dan Praktikum", "Tidak ada", "Tidak ada", "Sistem Basis Data dan Praktikum", "Pemrograman Dasar dan Praktikum", "Dasar Sistem Digital dan Praktikum", "Registrasi Administrasi adalah pembayaran biaya pendidikan sesuai dengan mekanisme yang diatur oleh UI.\n\nRegistrasi Akademik adalah kegiatan pembimbingan, pengisian, dan pengesahan mata kuliah pada IRS melalui sistem informasi akademik.", "Registrasi Administrasi adalah pembayaran biaya pendidikan sesuai dengan mekanisme yang diatur oleh UI.\n\nRegistrasi Akademik adalah kegiatan pembimbingan, pengisian, dan pengesahan mata kuliah pada IRS melalui sistem informasi akademik.", "Registrasi Administrasi adalah pembayaran biaya pendidikan sesuai dengan mekanisme yang diatur oleh UI.\n\nRegistrasi Akademik adalah kegiatan pembimbingan, pengisian, dan pengesahan mata kuliah pada IRS melalui sistem informasi akademik.", "Registrasi Administrasi adalah pembayaran biaya pendidikan sesuai dengan mekanisme yang diatur oleh UI.\n\nRegistrasi Akademik adalah kegiatan pembimbingan, pengisian, dan pengesahan mata kuliah pada IRS melalui sistem informasi akademik.", "Registrasi Administrasi dan Registrasi Akademik dilaksanakan sesuai jadwal yang ditetapkan dalam Kalender Akademik UI", "Karena mahasiswa harus melakukan registrasi akademis maupun registrasi administrasi. Dalam hal biaya pendidikan belum dibayar sampai akhir periode pembayaran, maka IRS dibatalkan. Selain itu, Mahasiswa yang tidak melaksanakan Registrasi Administrasi dan/ atau Registrasi Akademik akan\nmemperoleh Status Akademik tidak aktif (kosong) pada Semester berjalan dan Masa Studi diperhitungkan.", "Cuti Akademik dengan alasan khusus berarti status Mahasiswa yang tidak melakukan kegiatan akademik selama 1 (satu) Semester atau 2 (dua) Semester dengan persetujuan Dekan karena halangan yang tidak dapat dihindari", "Mahasiswa yang memiliki Status Akademik tidak aktif (kosong) sebagaimana dimaksud pada ayat (1) tidak diwajibkan membayar biaya pendidikan. Selain itu, Mahasiswa yang memiliki status akademik tidak aktif (Kosong) selama 2 (dua) semester berturut-turut, secara otomatis dinyatakan mengundurkan diri sebagai Mahasiswa.", "Mahasiswa yang memiliki Status Akademik tidak aktif (kosong) namun menginginkan Status Akademik aktif dapat melaksanakan Registrasi Administrasi dan Registrasi Akademik dengan mekanisme dan persyaratan sebagai berikut:\na. masih memenuhi persyaratan akademik;\nb. memperoleh persetujuan Fakultas dan rekomendasi dari pimpinan unit kerja yang menyelenggarakan urusan di bidang pendidikan;\nc. mengajukan permohonan izin pembayaran kepada pimpinan unit kerja yang menyelenggarakan urusan di bidang keuangan dan dikenai biaya keterlambatan Registrasi Administrasi yang besarnya sesuai Peraturan Rektor tentang Biaya Pendidikan Mahasiswa Universitas Indonesia;\nd. membayar biaya pendidikan secara manual;\ne. menyerahkan fotokopi bukti bayar kepada pimpinan unit kerja yang menyelenggarakan urusan di bidang keuangan untuk diverifikasi; dan\nf. melapor kepada wakil Dekan Yang menyelenggarakan urusan di bidang akademik untuk mengisi IRS\n\nPermohonan perubahan Status Akademik sebagaimana dimaksud disampaikan paling lambat 8 (delapan) minggu sejak periode perkuliahan dimulai", "Mahasiswa membuat video rekaman presentasi KP (durasi max 10 menit, tampilkan wajah dan slide-nya) dan membuatnya bisa diakses dari internet dengan sebuah link (misal dengan mengunggahnya di Youtube), Lengkapnya dapat dilihat di D'Office https://ee.ui.ac.id/d-office/dashboard", "Laporan KP dengan lembar pengesahan, log harian, link video presentasi ke D'Office", "Melihat Jadwal dan Timeline pada D'Office, Mendaftarkan Mata Kuliah Seminar/Pra-Skripsi di D''Office", "Dokumen yang perlu disiapkan\n- Form evaluasi bimbingan (tidak perlu form persetujuan sidang)\n- Log Bimbingan Mahasiswa\n- Lembar pengesahan untuk disisipkan di buku seminar yang siap uji", "Untuk Dresscode yang harus digunakan untuk sidang dapat dilihat di D'Office atau di Link berikut http://ee.ui.ac.id/d-office/assets/uploads/public/eed75-img-20221210-wa0000.jpg", "Dokumen yang perlu disiapkan\n- Form evaluasi bimbingan & persetujuan sidang\n- Lembar pengesahan sebelum sidang (hanya tanda tangan pembimbing) untuk disisipkan di buku yang siap uji.\n- Lembar pengesahan setelah sidang mengikuti format UI (tanda tangan pembimbing dan penguji; lihat Pedoman format penulisan di atas), untuk disisipkan di buku final/revisi pasca ujian.", "Melihat Jadwal dan Timeline pada D'Office, Mendaftarkan Mata Kuliah Skripsi di D''Office", "Berikut merupakan hal yang harus dilakukan, lengkapnya dapat dilihat di D'Office:\n1. Setelah sidang, catatan revisi harus diunduh di halaman Sidang Anda, dengan mengklik judul sidang Anda, dan klik Print pada bagian \"Lembar catatan revisi dan penetapan judul\".\n2. Setelah Anda menyelesaikan revisi, silakan unggah kelengkapan berkas final pasca revisi di halaman Sidang Anda, dengan mengklik tombol \"Upload hasil revisi\" di bawah judul sidang Anda.\n3. Bila terjadi perubahan judul &/ abstrak, Anda wajib mengupdatenya di website ini, karena SIAK akan memakai data dari website ini.\n4. Lulus sidang Skripsi/Tesis bukan berarti lulus studi. Kelulusan studi ditentukan melalui Yudisium.", "Untuk ide judul tugas akhir dapat dilihat di D'office pada link berikut: https://ee.ui.ac.id/d-office/semta/juduls", "3 SKS", "4 SKS", "3 SKS", "3 SKS", "3 SKS", "3 SKS", "3 SKS", "4 SKS", "3 SKS", "2 SKS", "2 SKS", "3 SKS", "2 SKS", "3 SKS", "3 SKS", "2 SKS", "4 SKS", "3 SKS", "1 SKS", "3 SKS", "3 SKS", "3 SKS", "3 SKS", "2 SKS", "2 SKS", "2 SKS", "2 SKS", "3 SKS", "3 SKS", "2 SKS", "2 SKS", "3 SKS", "3 SKS", "2 SKS", "2 SKS", "2 SKS", "2 SKS", "2 SKS", "3 SKS", "3 SKS", "2 SKS", "2 SKS", "Jumlah SKS yang dapat diambil tiap semester maksimal 24 SKS. Jumlah SKS yang dapat diambil disesuaikan dengan\nIndeks Prestasi Semester (IPS) pada Semester terakhir\nMahasiswa tersebut dengan status aktif, tidak termasuk\nSemester Antara.", "IPS < 2,00. SKS maksimum yang dapat diambil yaitu 12 SKS;\nIPS 2,00 sampai 2,49. SKS maksimum yang dapat diambil yaitu 15;\nIPS 2,50 sampai 2,99. SKS maksimum yang dapat diambil yaitu 18;\nIPS 3,00 sampai 3,49. SKS maksimum yang dapat diambil yaitu 21;\nIPS 3,50 sampai 4,00. SKS maksimul yang dapat diambil yaitu 24.", "Dalam kondiis Mahasiswa terancam Putus Studi, wakil Dekan yang menyelenggarakan urusan di bidang akademik dapat mempertimbangkan untuk mengizinkan Mahasiswa mengambil sks lebih dari jumlah maksimum sebagaimana dimaksud pada ayat (1) dan (21 atas usulan penanggung jawab penyelenggara / ketua Program Studi", "IRS tidak disetujui oleh Pembimbing Akademik dalam hal Mahasiswa:\na. mengambil mata kuliah yang jadwal kuliahnya berbenturan dengan mata kuliah lain;\nb. mengambil mata kuliah yang prasyaratnya belum dipenuhi;\nc. mengambil sks lebih daripada jumlah sks yang diperbolehkan ; dan/ atau\nd. mengambil mata kuliah yang jumlah pendaftarnya melebihi kapasitas yang disediakan", "Setiap Mahasiswa Program Sarjana harus lulus semua mata kuliah wajib dan sejumlah Mata Kuliah Pilihan yang tercakup dalam strulrhrr Kurikulum Program Studi", "Mata Kuliah Spesial adalah mata kuliah yang dalam pelaksanaannya mahasiswa akan dibimbing oleh seorang pembimbing sesuai dengan bidang keahliannya", "Mata Kuliah Spesial yang ada pada Teknik Komputer Universitas Indonesia yaitu Kerja Praktik, Seminar, dan Skripsi", "Untuk pengambilan mata kuliah spesial, sama seperti pengambilan mata kuliah pada umumnya di SIAK NG, kemudian ikuti prosedur pelaksanaan yang tertera pada D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "2 SKS", "ENCE606028", "Sesuai dengan topik yang disepakati oleh perusahaan tempat Kerja Praktek, disesuaikan dengan bidang keilmuan Teknik Komputer.", "Telah lulus 90 SKS", "Tidak ada, namun harus disesuaikan dengan silabus Teknik Komputer dan Perusahaan tempat Kerja Praktik", "Untuk prosedur pelaksanaan dan timeline mata kuliah spesial Kerja Praktik tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "Untuk teknik pelaksanaan sidang mata kuliah spesial Kerja Praktik tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "2 SKS", "ENCE607032", "Pendahuluan, Latar Belakang, Tujuan, Batasan Penelitian, Studi Literatur, Perancangan.", "Telah lulus 114 SKS", "1. Keputusan Rektor Universitas Indonesia Nomor 2143/SK/R/UI/2017 tentang Pedoman Teknis Penulisan Tugas Akhir Mahasiswa Universitas Indonesia\n2. IEEE Citation Reference.\n3. Ivan Stojmenovic, “How To Write Research Articles in Computing and Engineering Disciplines,” IEEE Transactions on Parallel And Distributed Systems, Vol. 21, No. 2, February 2010.", "Untuk prosedur pelaksanaan dan timeline mata kuliah spesial Seminar tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "Untuk teknik pelaksanaan sidang mata kuliah spesial Seminar tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "4 SKS", "ENCE608033", "Evaluasi Rancangan, Implementasi rancangan, Analisis, Kesimpulan, Abstrak", "Seminar", "1. Keputusan Rektor Universitas Indonesia Nomor 2143/SK/R/UI/2017 tentang Pedoman Teknis Penulisan Tugas Akhir Mahasiswa Universitas Indonesia\n2. IEEE Citation Reference.\n3. Ivan Stojmenovic, “How To Write Research Articles in Computing and Engineering Disciplines,” IEEE Transactions on Parallel And Distributed Systems, Vol. 21, No. 2, February 2010.", "Untuk prosedur pelaksanaan dan timeline mata kuliah spesial Seminar tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "Untuk teknik pelaksanaan sidang mata kuliah spesial Seminar tertera dalam website D'Office DTE FTUI https://ee.ui.ac.id/d-office/index.php/dashboard", "Mata kuliah spesial dapat diambil kapan saja selama sudah memenuhi prasyarat yang diperlukan", "Mata Kuliah Spesial yang masih berlanjut setelah Semester berakhir seperti kerja praktik, seminar serta Tugas Akhir diberi kode huruf BS (belum selesai) dan tidak diperhitungkan dalam perolehan sks, Indeks Prestasi Semester (IPS), dan Indeks Prestasi Kumulatif (rPK)", "Semester 1: Agama; Bahasa Inggris; Kalkulus; Fisika Listrik, Magnet, Gelombang dan Optik; Praktikum Fisika Listrik, Magnet, Gelombang dan Optik; Pemrograman Dasar dan Praktikum; Dasar Sistem Digital dan Praktikum (Total 18 SKS)\n\nSemester 3: Perancangan Sistem Digital dan Praktikum; Struktur Diskrit; Jaringan Komputer dan Praktikum; Pemrograman Berorientasi Objek dan Praktikum; Dasar Rangkaian Elektronika; Rangkaian Listrik Statistika (Total 20 SKS)\n\nSemester 5: Rekaya Perangkat Lunak; Sistem Waktu Nyata dan IoT dan Praktikum; Keamanan Jaringan Komputer dan Praktikum; Jaringan Telekomunikasi dan Praktikum; Arsitektur Komputer Moderen; Probabilitas dan Proses Stokastik; Teori Sinyal dan Analisis Sistem (Total 18 SKS)\n\nSemester 7: Desain Proyek Teknik Komputer 2; Seminar (Total 5 SKS)", "Semester 2: MPK Terintegrasi; Aljabar Linierl Fisika Mekanika dan Panas; Praktikum Fisika Mekanika dan Panas; Organisasi dan Arsitektur Komputer; Pemrograman Lanjut dan Praktikum (Total 19 SKS)\n\nSemester 4: Aljabar Linier Lanjut; Sistem Siber-Fisik dan Praktikum; Analisis Algoritma; Sistem Operasi; Desain dan Manjaemen Jaringan Komputer dan Praktikum; Sistem Basis Data dan Praktikum; Matematika Teknik; Praktikum Rangkaian Listrik dan Elektronik (Total 22 SKS)\n\nSemester 6: Desain Proyek Teknik Komputer 1; Pemrosesan Sinayl Multimedia; Kecerdasan Buatan; Kerja Praktek; Kewirausahaan dalam Teknologi Informasi; Profesionalisme dan Etika dalam Teknologi Informasi (Total 14 SKS)\n\nSemester 8: Skripsi (Total 4 SKS)", "Menghasilkan lulusan yang memiliki profil profesional mandiri (PPM) sebagai berikut: \n1. Menjadi profesional yang mampu merancang, menganalisis dan mengembangkan sistem, proses dan aplikasi dalam bidang teknik komputer untuk menghasilkan solusi sebagai alternatif pemecahan masalah di bidangnya. \n2. Menjadi individu profesional teknik komputer yang inklusif, termasuk menjadi bagian dari stakeholders yang memiliki kepedulian terhadap perkembangan teknologi komputer yang memiliki dampak terhadap peningkatan kualitas hidup masyarakat \n3. Menjadi individu atau profesional yang memiliki semangat inovasi dan jiwa wirausaha yang berintegritas dan beretika.", "Sarjana Teknik yang mampu merancang jaringan informasi dan sistem berbasis komputer secara sistematis dengan menggunakan metode baku sesuai dengan etika profesi", "System/solution developers in hardware, software and networks (40%); Telecommunication and IT services (29%); Bureaucrats in Ministry (8%); Agencies and Local Government (8%); IT instructors and academics (3%); Entrepreneur, Sales & Service Engineers (12%)", "Visi\nMenjadi program studi yang unggul dan berdaya saing dalam pendidikan dan penelitian di bidang Teknik Komputer sehingga mampu berkontribusi kepada masyarakat secara nasional dan global.\n\nMisi\n1. Menyiapkan lulusan Program Studi Teknik Komputer yang berintelektualitas tinggi, inovatif, mampu beradaptasi dengan kebutuhan dunia kerja, beretika dan berintegritas, memiliki semangat kebangsaan serta mampu bersaing secara global.\n2. Menyelenggarakan pendidikan dan penelitian yang berkualitas, termasuk meningkatkan pengabdian kepada masyarakat, dan mampu menjawab tantangan nasional maupun global dengan merespon, dan memberikan solusi terhadap permasalahan di masyarakat.", "Program Sarjana (S1) Reguler dan Progam Sarjana (S1) Paralel", "Sarjana Teknik (S.T.)", "BAN-PT: Akreditasi-A\nAUN: More than adequate (5)\nIABEE: General Accreditation", "144 SKS", "1. Mampu membuat rancangan sistem teknologi komputer yang cerdas, dan aman berbasis kebutuhan masyarakat dalam berbagai bidang kehidupan (C6)\n2. Mampu membuat rancangan jaringan informasi (C6)\n3. Mampu membuat rancangan perangkat keras untuk sistem berbasis komputer (C6)\n4. Mampu membuat rancangan perangkat lunak untuk sistem berbasis komputer (C6)\n5. Mampu merancang algoritma untuk masalah tertentu dan mengimplementasikannya ke dalam pemrograman (C6)\n6. Mampu menyelesaikan permasalahan teknik komputer dengan menerapkan prinsip dasar matematika, fisika, dan data analitik (C4)\n7. Mampu menggunakan bahasa lisan dan tulisan dalam bahasa Indonesia dan bahasa Inggris dengan baik untuk kegiatan akademik maupun nonakademik (C3, A5)\n8. Memiliki integritas dan mampu berpikir kritis, kreatif, dan inovatif serta memiliki keingintahuan intelektual untuk memecahkan masalah pada tingkat individual dan kelompok (C4, A4)\n9. Mampu memanfaatkan teknologi informasi komunikasi (C3)\n10. Mampu memberikan alternatif pemecahan masalah terhadap beragam masalah yang timbul di lingkungan masyarakat, bangsa, dan negara (C4, A2)\n11. Mampu mengidentifikasi ragam upaya wirausaha yang bercirikan inovasi dan kemandirian yang berlandaskan etika (C4, A5)", "System/solution developers in hardware, software and networks (40%); Telecommunication and IT services (29%); Bureaucrats in Ministry (8%); Agencies and Local Government (8%); IT instructors and academics (3%); Entrepreneur, Sales & Service Engineers (12%)", "Setiap lulusan program pendidikan akademik, vokasi, dan profesi harus memiliki sikap sebagai berikut: \na. bertakwa kepada Tuhan Yang Maha Esa dan mampu menunjukkan sikap religius;\nb. menjunjung tinggi nilai kemanusiaan dalam menjalankan tugas berdasarkan agama,moral, dan etika;\nc. berkontribusi dalam peningkatan mutu kehidupan bermasyarakat, berbangsa, bernegara, dan kemajuan peradaban berdasarkan Pancasila;\nd. berperan sebagai warga negara yang bangga dan cinta tanah air, memiliki nasionalisme serta rasa tanggungjawab pada negara dan bangsa; \ne. menghargai keanekaragaman budaya, pandangan, agama, dan kepercayaan, serta pendapat atau temuan orisinal orang lain; \nf. bekerja sama dan memiliki kepekaan sosial serta kepedulian terhadap masyarakat dan lingkungan; \ng. taat hukum dan disiplin dalam kehidupan bermasyarakat dan bernegara; \nh. menginternalisasi nilai, norma, dan etika akademik;\ni. menunjukkan sikap bertanggungjawab atas pekerjaan di bidang keahliannya secara mandiri; dan \nj. menginternalisasi semangat kemandirian, kejuangan, dan kewirausahaan.", "1. Mampu membuat rancangan jaringan informasi;\n2. Mampu membuat rancangan perangkat keras untuk sistem berbasis komputer;\n3. Mampu membuat rancangan sistem, komponen, dan proses berlatar kebutuhan dalam berbagai bidang kehidupan.", "1. Mampu membuat rancangan perangkat lunak untuk sistem berbasis komputer.\n2. Mampu membuat algoritma dan mengimplementasikannya ke dalam pemrograman.\n3. Mampu menyelesaikan permasalahan teknik komputer dengan menerapkan prinsip dasar matematika, fisika, dan data analitik.\n4. Mampu membuat rancangan perangkat lunak untuk sistem berbasis komputer\n5. Mampu merancang algoritma untuk masalah tertentu dan mengimplementasikannya ke dalam pemrograman", "Hubungin Dosen Pembimbing anda atau hubungi Pak Ruki apabila terdapat masalah pada D'Office", "Konversi SKS kegiatan MBKM tetap akan dicantumkan pada SIAK dan pada semester MBKM tersebut dijalankan", "Untuk MK yg akan dikonversi tulis *MK pilihan* saja", "Mk pilihan tidak perlu penyetaraan.", "Pakai format laporan dari departemen yang ada di d'office", "Tidak ada deadline, namun harus segera diajukan setelah berkas yang dibutuhkan sudah lengkap", "Seluruh berkas di merge menjadi 1 File PDF mulai dari Sertifikat, Transkrip Nilai, Silabus, Laporan, dan semacamnya", "Diisi data diri anda aja yang bisa anda isi", "Diisi sesuai semester anda mengikuti MBKM", "Memang seperti itu, untuk kelulusan akan tetap dihitung", "Total SKS yang dihitung dijumlahkan dengan SKS hasil MBKM yang sudah dilakukan", "Ketentuan transfer SKS pada kebijakan DTE bergantung pada kebijakan transfer SKS FTUI yang tertera di dalam Guidebook MBKM yang ada pada deskripsi grup MBKM dan mengajukan pada link https://bit.ly/penyetaraanMBKM", "Transfer Kredit adalah pengakuan terhadap sejumlah Beban Studi yang telah diperoleh seorang Mahasiswa pada suatu perguruan tinggi setelah proses evaluasi oleh tim Transfer Kredit pada masing-masing Fakultas di lingkungan UI", "Benar, namun untuk angkatan 2020, 2021, dst menjadi mata kuliah wajib", "Aturan kurikulum transisi yaitu sebuah aturan penyesuaian kurikulum dari kurikulum lama menjadi kurikulum lama untuk beberapa angkatan tertentu agar angkatan tersebut dapat menyesuaikan kurikulum baru. Untuk saat ini, seluruh angkatan di Teknik Komputer sudah menggunakan kurikulum terbaru yaitu kurikulum 2020.", "Kurikulum 2020 mulai diberlakukan mulai angkatan 2020.", "Bagi mahasiswa yang belum lulus mata kuliah wajib pada Kurikulum 2016, diharuskan mengambil mata kuliah wajib yang sama atau setara di Kurikulum 2020. Mata kuliah wajib yang dijadikan pilihan di Kurikulum 2020 tidak wajib diambil untuk angkatan 2019 dan sebelumnya.", "Mata kuliah wajib yang dijadikan pilihan di Kurikulum 2020 tidak wajib diambil untuk angkatan 2019 dan sebelumnya.", "Apabila terjadi perubahan SKS mata kuliah, maka jumlah SKS yang diperhitungkan adalah jumlah SKS pada saat mata kuliah tersebut diambil terakhir. Misalnya, mata kuliah yang sama atau yang disetarakan dengan bobot SKS berbeda, apabila diulang atau baru diambil akan tercantum dengan nama baru dan dihitung dengan bobot SKS baru", "Mata kuliah wajib baru di Kurikulum 2020 yang tidak ada kesetaraannya terhadap kurikulum 2016, tidak wajib diambil oleh mahasiswa Angkatan 2019 dan sebelumnya", "Bila mata kuliah wajib di Kurikulum 2016 dihapus dan tidak ada kesetaraannya di Kurikulum 2020, bagi mahasiswa yang sudah lulus mata kuliah tersebut, maka tetap dihitung sebagai SKS mata kuliah wajib dalam perhitungan kelulusan 144 SKS. Bagi mahasiswa yang belum lulus mata kuliah tersebut, dapat mengambil mata kuliah wajib baru atau mata kuliah pilihan pada Kurikulum 2020 untuk melengkapi 144 SKS", "Kurikulum 2020", "Pembimbing Akademik adalah Dosen yang ditunjuk oleh Fakultas / Sekolah untuk membimbing dan mengarahkan Mahasiswa dalam menyusun rencana studi sesuai dengan aturan yang berlaku, serta mengikuti perkembangan studi Mahasiswa.", "Kurikulum adalah seperangkat rencana dan pengaturan mengenai tujuan, isi, dan bahan pelajaran, serta cara penyampaian dan penilaiannya yang digunakan sebagai pedoman penyelenggaraan pembelajaran untuk mencapai tujuan program pendidikan tertentu.", "Mata Kuliah Wajib merupakan mata kuliah yang wajib diambil untuk mencapai kelulusan dan memperoleh gelar akademik\n\nMata Kuliah Wajib UI adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di UI\n\nMata Kuliah Wajib Fakultas adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di Fakultas tersebut.\n\nMata Kuliah Wajib Program Studi adalah mata kuliah yang harus dicakup dalam suatu Program Studi yang dirumuskan untuk mencapai Capaian Pembelajaran Lulusan Program Studi yang bersangkutan", "Mata Kuliah Wajib merupakan mata kuliah yang wajib diambil untuk mencapai kelulusan dan memperoleh gelar akademik\n\nMata Kuliah Wajib UI adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di UI\n\nMata Kuliah Wajib Fakultas adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di Fakultas tersebut.\n\nMata Kuliah Wajib Program Studi adalah mata kuliah yang harus dicakup dalam suatu Program Studi yang dirumuskan untuk mencapai Capaian Pembelajaran Lulusan Program Studi yang bersangkutan", "Mata Kuliah Wajib merupakan mata kuliah yang wajib diambil untuk mencapai kelulusan dan memperoleh gelar akademik\n\nMata Kuliah Wajib UI adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di UI\n\nMata Kuliah Wajib Fakultas adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di Fakultas tersebut.\n\nMata Kuliah Wajib Program Studi adalah mata kuliah yang harus dicakup dalam suatu Program Studi yang dirumuskan untuk mencapai Capaian Pembelajaran Lulusan Program Studi yang bersangkutan", "Mata Kuliah Wajib merupakan mata kuliah yang wajib diambil untuk mencapai kelulusan dan memperoleh gelar akademik\n\nMata Kuliah Wajib UI adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di UI\n\nMata Kuliah Wajib Fakultas adalah mata kuliah yang wajib ada pada setiap kurikulum Program Sarjana di Fakultas tersebut.\n\nMata Kuliah Wajib Program Studi adalah mata kuliah yang harus dicakup dalam suatu Program Studi yang dirumuskan untuk mencapai Capaian Pembelajaran Lulusan Program Studi yang bersangkutan", "Isian Rencana Studi yang selanjutnya disingkat IRS adalah rencana kegiatan alademik yang akan dilakukan oleh seorang Mahasiswa selama Semester tertentu sebagaimana dimaksudkan dalam Registrasi Akademik.", "Satuan kredit semester yang selanjutnya disingkat sks adalah takaran penghargaan terhadap kegiatan belajar yang diperoleh peserta didik selama satu Semester", "Masa Studi adalah batas masa untuk menyelesaikan beban studi dalam mengikuti proses pendidikan pada Program Studi", "Semester merupakan satuan waktu proses pembelajaran efektif selama paling sedikit 16 (enam belas) minggu, termasuk ujian tengah Semester dan ujian akhir Semester", "Semester Antara adalah Semester yang bersifat opsional yang dapat diselenggarakan antara Semester genap dan Semester gasal tahun akademik berikutnya.", "Cuti Akademik adalah kondisi tidak mengikuti kegiatan akademik untuk waktu sekurang-kurangnya I (satu) Semester dan sebanyak-banyaknya 2 (dua) Semester", "Program Sarjana bertujuan untuk menyiapkan Mahasiswa menjadi intetektual dan ilmuwan yang beretika, berbudaya, kompeten, mampu memasuki dan/atau menciptakan lapangan kerja, serta mampu mengembangkan diri menjadi profesional.", "Yudisium merupakan proses verifikasi untuk penetapan kelulusan, diawali dari jenjang departemen, fakultas, hingga universitas.\n\nDaftar berkas yang harus dilengkapi untuk diverifikasi di tingkat fakultas, tempat unggah, dan batas waktu pengumpulannya harap perhatikan info di D'Office\n\n1. scan lembar catatan perbaikan skripsi/tesis/desertasi yang telah ditandatangani lengkap\n2. buku skripsi/tesis/desertasi final (PDF, sudah ditandatangani seluruh penguji dan pembimbing)\n3. buku skripsi/tesis/desertasi final (MsWord/editable)\npaparan presentasi (PPT/editable, bukan PDF)\n4. data hasil penelitian bila diperlukan (zip, sebagai supporting document, sesuai arahan pembimbing)\n5. naskah ringkas berbahasa Inggris dengan format IEEE (5-15 halaman) atau format lain bila sudah disubmit ke conference/jurnal (MsWord/editable, meskipun sudah published)\n6. mengisi survey calon lulusan bila dibutuhkan oleh program studi\n\nUntuk info lebih lengkap mohon lihat di D'Office", "Yudisium merupakan proses verifikasi untuk penetapan kelulusan, diawali dari jenjang departemen, fakultas, hingga universitas.\n\nDaftar berkas yang harus dilengkapi untuk diverifikasi di tingkat fakultas, tempat unggah, dan batas waktu pengumpulannya harap perhatikan info di D'Office\n\n1. scan lembar catatan perbaikan skripsi/tesis/desertasi yang telah ditandatangani lengkap\n2. buku skripsi/tesis/desertasi final (PDF, sudah ditandatangani seluruh penguji dan pembimbing)\n3. buku skripsi/tesis/desertasi final (MsWord/editable)\npaparan presentasi (PPT/editable, bukan PDF)\n4. data hasil penelitian bila diperlukan (zip, sebagai supporting document, sesuai arahan pembimbing)\n5. naskah ringkas berbahasa Inggris dengan format IEEE (5-15 halaman) atau format lain bila sudah disubmit ke conference/jurnal (MsWord/editable, meskipun sudah published)\n6. mengisi survey calon lulusan bila dibutuhkan oleh program studi\n\nUntuk info lebih lengkap mohon lihat di D'Office", "Yudisium merupakan proses verifikasi untuk penetapan kelulusan, diawali dari jenjang departemen, fakultas, hingga universitas.\n\nDaftar berkas yang harus dilengkapi untuk diverifikasi di tingkat fakultas, tempat unggah, dan batas waktu pengumpulannya harap perhatikan info di D'Office\n\n1. scan lembar catatan perbaikan skripsi/tesis/desertasi yang telah ditandatangani lengkap\n2. buku skripsi/tesis/desertasi final (PDF, sudah ditandatangani seluruh penguji dan pembimbing)\n3. buku skripsi/tesis/desertasi final (MsWord/editable)\npaparan presentasi (PPT/editable, bukan PDF)\n4. data hasil penelitian bila diperlukan (zip, sebagai supporting document, sesuai arahan pembimbing)\n5. naskah ringkas berbahasa Inggris dengan format IEEE (5-15 halaman) atau format lain bila sudah disubmit ke conference/jurnal (MsWord/editable, meskipun sudah published)\n6. mengisi survey calon lulusan bila dibutuhkan oleh program studi\n\nUntuk info lebih lengkap mohon lihat di D'Office"], "label": ["BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BahasanMatkul", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "BukuAjar", "Kelulusan", "Kelulusan", "Kelulusan", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "KodeMatkul", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "MBKM", "Umum", "Umum", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Pilihan", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Prasyarat", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Registrasi", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "SKS", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Spesial", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Tekkom", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transfer", "Transisi", "Transisi", "Transisi", "Transisi", "Transisi", "Transisi", "Transisi", "Transisi", "Transisi", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Umum", "Kelulusan", "Kelulusan", "Kelulusan"]}